{
    "admission": {
        "y1": [
            [
                "CC0003",
                "CC0005",
                "MH1810",
                "MS1013",
                "MS1016",
                "MS1017",
                "PH1011"
            ],
            [
                "CC0001",
                "CC0002",
                "EG1001",
                "MS1008",
                "MS1014",
                "MS1018",
                "MS2013",
                "BDE 1"
            ],
            [
                "CC0007",
                "MH2811",
                "MS2012",
                "MS2015",
                "MS2016",
                "BDE 2",
                "BDE 3",
                "MS2083"
            ],
            [
                "ML0004",
                "CC0006",
                "MS0003",
                "MS2014",
                "MS2018",
                "MS2084",
                "MS3082",
                "BDE 4"
            ],
            [
                "HW0288",
                "MS3011",
                "MS3012",
                "MS3013",
                "MS3014",
                "MS3015",
                "BDE 5"
            ],
            [
                "MS3099"
            ],
            [
                "MS4089",
                "MS4012",
                "MS4013",
                "MPE",
                "MPE"
            ],
            [
                "MS4014",
                "MPE",
                "MPE"
            ]
        ],
        "dy2": [
            [
                "CC0002",
                "CC0005",
                "EG1001",
                "MS1008",
                "MS1016",
                "MS1017",
                "MH1810"
            ],
            [
                "CC0001",
                "MH2811",
                "MS0003",
                "MS1018",
                "MS2013",
                "MS2014",
                "MS2083"
            ],
            [
                "ML0004",
                "HW0288",
                "MS2012",
                "MS2015",
                "MS2016",
                "MS3011",
                "MS3082",
                "BDE 1"
            ],
            [
                "CC0003",
                "MS2018",
                "MS3012",
                "MS3013",
                "MS3014",
                "MS3015",
                "MS2084"
            ],
            [
                "MS3096"
            ],
            [
                "CC0007",
                "MS4089",
                "MS4012",
                "MS4013",
                "MPE",
                "MPE"
            ],
            [
                "CC0006",
                "MS4014",
                "BDE 2",
                "BDE 3",
                "MPE"
            ]
        ]
    },
    "courses": [
        {
            "code": "MS1017",
            "title": "Introduction to Materials Science",
            "coreq": [
                "MS1016",
                "MS2018"
            ],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms1017-introduction-to-materials-science.pdf",
            "aus": 2,
            "type": "Core",
            "instructor": [
                "Tan Kwan Wee"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00165"
            ],
            "semester": 0,
            "content": {
                "courseAims": "Introduction to Materials Science’ initiates students to the fascinating world of Materials across different length scales from atoms to devices and applications, starting from a historical perspective of materials developments at the beginning of civilizations to today’s advanced materials powering growth of societies in this modern world. You will gain knowledge in the fundamental aspects of bonding, crystallography, microstructures and phases for the three key classes  of materials systems, that is, metals, polymers and ceramics. Understand these facets will allow you to design and control the associated materials properties.",
                "ilo": "By the end of this course, you (as a student) would be able to:\n1. Determine the types of atomic and molecular bonds of materials based on the knowledge of the electronic configurations of the elements and the Periodic Table .\n2. Construct basic crystallographic crystal structures (e.g., cubic), crystal directions and planes based on the Miller indices.\n3. Analyse the equilibrium phase diagram and perform calculations to derive compositional and structural information.\n4. Determine mechanical properties materials from stress-strain curves.\n5. Explain the basics of optical and electron microscopy.\n6. Evaluate the importance of Materials Science in engineering technologies from a broader context.",
                "courseContent": "1. General introduction of Materials Science:\n- A historical perspective through Ages of Civilisation (e.g., Stone, Bronze, Iron ages)\n- Highlights of materials’ structure-process-property relationships using contemporary applications and technological advancements\n\n2. Atomic Bonding and Crystal Structures:\n- Primary and secondary bonds, bond energy and force curves, molecular orbital theory,\n- Crystal structures and Bravais lattices, Crystallographic directions and Miller indices, Reciprocal space\n- Crystal and molecular structures of ceramics and polymers\n\n3. Phase diagrams\n- Concepts of the phase diagrams and Gibbs phase rule,\n- Single and binary phase diagrams, solid solubility, intermediate phases, eutectic and eutectoid systems of solids, miscibility gaps.\n- Applying inverse lever rule calculations in phase diagrams\n\n4. Mechanical properties of materials\n- Stress and strain of materials\n- Mechanical properties such as elastic modulus, yield strength, tensile strength, plastic deformation, fracture, creep, fatigue, viscosity, and how these properties relate to practical applications\n- Deformation and fracture mechanisms of materials\n- Recrystallization\n\n5. Introduction to Materials Characterization – Microscopy\n- Principles of optical and electron microscopy\n- Microstructures - Grain structures, grain boundaries, Defects, Eutectic microstructures, dendrites\n- Metals and Ceramics – Ductile and brittle microstructures\n- Polymers – Spherulite, Crazing\n\n6. Engineering Materials in Modern Applications and Technologies\n- Metals: Ferrous and non-ferrous, crystal structure and bonds, processing technologies and phase development\n- Ceramics: Structures, properties, processing and applications\n- Polymers: Introduction and classification of polymers, molecular weights and distributions, temperature behaviours such as Tg, Tm, Introducing viscosity and associated properties of polymers\n\n7. Laboratory Sessions:\n- Tensile stress-strain measurements of metals and polymers\n- Sample preparation (etching, polishing) and using optical microscope to study metals/polymers/ceramics samples.",
                "courseReference":"Suggested reading:\n\n - Materials Science and Engineering, 10th Edition, SI Version, Willian D. Callister, David G.Rethwisch,2018, John Wiley & Sons Inc.\n\nAdditional reading:\n\n-Introduction to Materials Science for Engineers, James F. Shackleford, 8th Edition, Global Edition,Pearson."
            }
        },
        {
            "code": "BDE 1",
            "title": "",
            "coreq": [],
            "prereq": [],
            "link": "",
            "aus": "",
            "type": "BDE",
            "instructor": [],
            "instructor_link": [],
            "semester": 999
        },
        {
            "code": "BDE 2",
            "title": "",
            "coreq": [],
            "prereq": [],
            "link": "",
            "aus": "",
            "type": "BDE",
            "instructor": [],
            "instructor_link": [],
            "semester": 999
        },
        {
            "code": "BDE 3",
            "title": "",
            "coreq": [],
            "prereq": [],
            "link": "",
            "aus": "",
            "type": "BDE",
            "instructor": [],
            "instructor_link": [],
            "semester": 999
        },
        {
            "code": "BDE 4",
            "title": "",
            "coreq": [],
            "prereq": [],
            "link": "",
            "aus": "",
            "type": "BDE",
            "instructor": [],
            "instructor_link": [],
            "semester": 999
        },
        {
            "code": "BDE 5",
            "title": "",
            "coreq": [],
            "prereq": [],
            "link": "",
            "aus": "",
            "type": "BDE",
            "instructor": [],
            "instructor_link": [],
            "semester": 999
        },
        {
            "code": "MPE",
            "title": "",
            "coreq": [],
            "prereq": [],
            "aus": "",
            "type": "MPE",
            "instructor": [],
            "instructor_link": [],
            "semester": 999
        },
        {
            "code": "MS1016",
            "title": "Thermodynamics of Materials",
            "coreq": [
                "MS1015",
                "MS1017"
            ],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms1016_thermodynamics_of_materials.pdf",
            "aus": 3,
            "type": "Core",
            "instructor": [
                "Ng Wei Tat, Leonard"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00832",
                "https://dr.ntu.edu.sg/cris/rp/rp01299"
            ],
            "semester": 0,
            "content": {
                "courseAims": "This course aims to acquaint you with the basic concepts and laws of thermodynamics and expose you to how thermodynamics is applied to various classes of materials and related phenomena. Emphasis has also been placed on the connections between thermodynamic concepts and materials phenomena. It is essential for successful materials scientists and engineers to acquire basic knowledge on thermodynamics which is devoted to the study of energy and its transformations.",
                "ilo": "By the end of this course, you would be able to:\n1. Explain the 1st law of thermodynamics and its applications to close and open systems.\n2. Explain the 2nd law of thermodynamics, and describe the difference between a reversible process and an irreversible process.\n3. Explain Maxwell’s relations and describe their applications to deriving thermodynamic properties.\n4. Calculate partial molar volumes, volume of mixing and entropy of mixing for a binary solution.\n5. Describe the condition of equilibrium between two states, and apply it to derive the Clausius -Clapeyron equation and explain vapor equilibria.\n6. Describe the difference between 1st-order and 2nd-order phase transitions.\n7. Describe chemical equilibrium and c alculate the equilibrium constant.\n8. Describe the thermodynamics of solutions.\n9. Explain the Gibbs phase rule, and use it to describe phase diagrams.\n10. Explain the lever rule and its application.\n11. Describe the phase rule for condensed systems and eutectic phase  diagrams.\n12. Describe three -component phase diagrams.\n13. Explain electrochemical equilibrium, and apply Nernst equation to calculate electrochemical equilibrium.",
                "courseContent": "Imperfections in solids, diffusion in solid systems, interface movement and solidification (includes nucleation, grain growth and further solidification), phase transformations and kinetics in solids (emphasis on steels).",
                "courseReference":"Suggested reading:\n\n- Thermodynamics of Materials Vol I, David V Ragone, John Wiley & Sons Inc, 1995.\n- Introduction to the Thermodynamics of Materials,6th edition, David R Gaskell, David ELaughlin, CRC Press, 2018."
            }
        },
        {
            "code": "MS1013",
            "title": "Materials Chemistry 1",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms1013_materials_chemistry_i.pdf",
            "aus": 2,
            "type": "Fundamental Math and Sciences",
            "instructor": [
                "Andrew Clive Grimsdale"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00684"
            ],
            "semester": 0,
            "content": {
                "courseAims": "The aim of this course is to provide you with fundamental understanding of basic chemistry which includes inorganic chemistry, physical chemistry, and analytical chemistry.",
                "ilo": "By the end of this course, you (as a student)  would be able to:\n1. Write and balance chemical equations and perform stoichiometric calculations.\n2. Identify the nomenclature of common inorganic compounds.\n3. Compare reactivities of metals based on their electronic structures.\n4. Interpret properties of inorganic compounds based on periodic relationships among the elements.\n5. Determine rate law and integrated rate law expressions and interpret reaction mechanisms.\n6. Determine equilibrium constants, perform calculations involving solubility including Ksp, and apply Le Chatelier's Principle.\n7. Distinguish strong and weak acids and bases, and perform calculations to determine concentrations, pH, Ka, etc.\n8. Apply acid-base titration in analytical chemistry.",
                "courseContent": "It introduces basic chemistry concepts and theories that are important for understanding of the chemistry of materials. The inorganic chemistry part includes an introduction to basic chemistry concepts ,atomic orbital theory, and periodic relationships among the elements. The physical chemistry includes basic concepts of thermodynamics and kinetics, and the analytical chemistry covers acids and bases and the use of acid-base titration as an analytical method.",
                "courseReference": "Chang, Raymond, Chemistry, 11th Edition, McGraw-Hill, 2012 (Call no.: QD31.2.C456 2013)"
            }
        },
        {
            "code": "MH1810",
            "title": "Mathematics 1",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider123/obtl/mas/updated-obtl/mh1810-spms-eng-outcomes-based-teaching-and-learning-document-(obtl)-7th-dec-2020.pdf?sfvrsn=df0d7c0_3",
            "aus": 3,
            "type": "Fundamental Math and Sciences",
            "instructor": [],
            "instructor_link": [],
            "semester": 0,
            "content": {
                "courseAims": "In this course, the basic concepts of limits, differentiation and integration are introduced.Applications of differential and integral calculus are included. In addition, the course alsocovers topics on complex numbers, vectors and matrices. It aims to prepare the first yearengineering students for further courses in engineering disciplines and more advancedmathematics in year 2.\nThis course aims to equip you with\n• mathematical knowledge and analytical skills so that you are able to apply techniques of advanced calculus (along with their existing mathematical skills) to solve engineering or scientific problems whenever applicable;\n• mathematical reading skills so that you can read and understand related mathematical content in the basic and popular scientific and engineering literature; and\n• mathematical communication skills so that you can effectively and rigorously present your mathematical ideas to mathematicians, scientists and engineers.",
                "ilo": "Upon successfully completing this course, you should be able to:\n1. Evaluate product, quotient, power and roots of complex numbers.\n2. Use vector operators (dot product and cross product) to solve simple mechanics and geometry problems (e.g. find work done, moment, equations for planes, distance form a point to a plane etc.).\n3. Evaluate matrix determinants and use Cramer’s rule to solve simultaneous equations\n4. Use limit to determine if a function is continuous.\n5. Evaluate the derivatives of simple functions from the definition.\n6. Evaluate the derivatives of more complicated functions by using rules of differentiation (e.g. product rule and chain rule).\n7. Use the derivatives to establish linear approximations, estimate changes and solve nonlinear equations (by Newton’s method).\n8. Use the derivatives to assist in curve sketching and solving optimization problems.\n9. Evaluate integrals by using integration formulae, rules of algebra and substitution techniques.\n10. Evaluate more complicated integrals by using “integration by parts”, “trigonometric substitutions”, “partial fractions”, “reduction formulae” and special techniques for integrands involving quadratic or trigonometric expressions.\n11. Evaluate definite integrals by using trapezium & Simpson’s rules and perform error analysis.\n12. Evaluate improper integrals of the first, second & third kinds, and test for convergence.\n13. Interpret the meaning of integration by using the concept of Riemann sum.\n14. Use integration to find areas between curves (by dividing into vertical or horizontal strips) and volumes of solids (slicing & cylindrical shells methods).\n15. Use integration to find volumes of solids of revolution (slicing & cylindrical shells methods).\n16. Use integration to find lengths of plane curves and areas of surfaces of revolution.\n17. Use mean value theorem, fundamental theorem of calculus and Leibniz’s rule to evaluate expressions involving differentiation and integration.",
                "courseContent": "COMPLEX NUMBERS, VECTORS AND MATRICES Complex plane, polar coordinates and polar form of complex numbers, powers and roots, fundamental theorem of algebra. Vector algebra in 2-D and 3-D space, dot product and cross product, lines and planes in space, applications. Matrices, matrix addition and multiplication, determinants, Cramer’s rule.\nLIMITS AND CONTINUITY OF FUNCTIONS Limits of functions, types of limits, the Sandwich Theorem, evaluation of limits, continuity of functions, properties of continuous functions.\nDERIVATIVES Derivatives, differentiability, rules and properties, differentiation of transcendental functions, higher order derivatives, implicit differentiation, formulae, linearization, estimate changes, Newton’s Method, hyperbolic functions.\nAPPLICATIONS OF DERIVATIVES Extreme values, points of inflection and curve sketching, Rolle’s Theorem, Mean Value Theorem, optimization, indeterminate forms, L’Hopital’s Rule.\nINTEGRATION Anti-derivatives, Riemann Sum, indefinite and definite integration, Mean Value Theorem for definite integral, Fundamental Theorem of Calculus. Trapezoidal Rule, Simpson’s Rule.\nINTEGRATION METHODS Basic integration formulae for algebraic and transcendental functions. Integration by special devices: integration by parts, rationalizing substitution or trigonometric substitution, partial fractions, reduction formulas, improper integrals, convergence tests.\nAPPLICATIONS OF INTEGRATION Area between curves, volume of a general solid by slicing and cylindrical shell methods, volume of a solid of revolution, length of a plane curve, area of a surface of revolution.",
                "courseReference":"Text book:\nThomas’ Calculus,13th edt, Thomas, GB Jr., Weir MD and Hass J, Pearson-Addison-Wesley,978-1292089799,2016\n\nReference:\nCalculus (International Student Edition),6th edt, James Stewart, Thomson,9780495482826Brooks/Cole"
            }
        },
        {
            "code": "PH1011",
            "title": "Physics A",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ph1011_physics.pdf",
            "aus": 3,
            "type": "Fundamental Math and Sciences",
            "instructor": [],
            "instructor_link": [],
            "semester": 1,
            "content": {
                "courseAims": "This course will reinforce students’ understanding of physics from A -level. It will encourage critical thinking by emphasizing on reasoning, understanding the relationship between concepts and seeing the relevance of physics to everyday life. It will teach strategies for problem solving that can be applied to real world situations. After the study, students will be equipped with the basic knowledge for further study in the broad field of engineering.",
                "ilo": "Upon successful completion of the course, students will be able to:\n• Analyze the kinematics of a particle in order to predict its motion in standard 1-D and 2-D coordinate systems.\n• Set up and solve vector equations for velocities and accelerations of simple motion of particles.\n• Understand the concepts of forces and torques; Be able to solve equilibrium problems of rigid bodies.\n• Understand the Newton’s laws; Be able to solve motion problems using Newton’s laws.\n• Apply strategy for solving particle kinetic problems using the work and energy principle and the impulse and momentum principle.\n• Understand basic thermodynamic laws and principles and use them for analysing simple engineering problems.\n• Understand the basic concepts on topics related to electrical and magnetic fields, Ohm’s Law, charged particle motion, and basic electrical circuit components.\n• Undertake more advanced study in mechanical, electrical or civil engineering in the following semesters.",
                "courseContent": "VECTORS. KINEMATICS. FORCES AND TORQUES. NEWTON’S LAWS OF MOTION. IMPULSE AND MOMENTUM. WORK AND ENERGY. THERMAL PHYSICS. ELECTRIC FIELD. MAGNETIC FIELD. MOTION OF CHARGED PARTICLES AND APPLICATIONS. CIRCUITS",
                "courseReference": "Physics for Scientists and Engineers, 8th Edition\nR A Serway, J W Jewett Jr \nBrooks Cole\n\nCollege Physics: A Strategic Approach\nRandall D. Knight, Brian Jones, Stuart Field\nAddison Wesley"
            }
        },
        {
            "code": "PH1012",
            "title": "Physics A",
            "coreq": [
                "MS1016",
                "MS2018"
            ],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ph1011_physics.pdf",
            "aus": 4,
            "type": "Fundamental Math and Sciences",
            "instructor": [],
            "instructor_link": [],
            "semester": 1,
            "content": {
                "courseAims": "This course will reinforce students’ understanding of physics from A-level. It will encourage critical thinking by emphasizing on reasoning, understanding the relationship between concepts and seeing the relevance of physics to everyday life. It will teach strategies for problem solving that can be applied to real world situations. After the study, students will be equipped with the basic knowledge for further study in the broad field of engineering.",
                "ilo": "Upon successful completion of the course, students will be able to:\n• Analyze the kinematics of a particle in order to predict its motion in standard 1-D and 2-D coordinate systems.\n• Set up and solve vector equations for velocities and accelerations of simple motion of particles.\n• Understand the concepts of forces and torques; Be able to solve equilibrium problems of rigid bodie s.\n• Understand the Newton’s laws; Be able to solve motion problems using Newton’s laws.\n• Apply strategy for solving particle kinetic problems using the work and energy principle and the impulse and momentum principle.\n• Understand basic thermodynamic laws and principles and use them for analysing simple engineering problems.\n• Understand the basic concepts on topics related to electrical and magnetic fields, Ohm’s Law, charged particle motion, and basic electrical circuit components.\n• Undertake more advanced st udy in mechanical, electrical or civil engineering in the following semesters.",
                "courseContent": "VECTORS. KINEMATICS. FORCES AND TORQUES. NEWTON’S LAWS OF MOTION. IMPULSE AND MOMENTUM. WORK AND ENERGY. THERMAL PHYSICS. ELECTRIC FIELD. MAGNETIC FIELD. MOTION OF CHARGED PARTICLES AND APPLICATIONS. CIRCUITS",
                "courseReference": "Physics for Scientists and Engineers, 8th Edition\nR A Serway, J W Jewett Jr \nBrooks Cole\n\nCollege Physics: A Strategic Approach\nRandall D. Knight, Brian Jones, Stuart Field\nAddison Wesley"
            }
        },
        {
            "code": "CC0003",
            "title": "Ethics & Civics in a Multi Cultural World",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/default-source/default-document-library/inspire/cc0003-outline-ay2021-s28631bdc2-fab3-4039-a923-723ef29f6e8e.pdf",
            "aus": 3,
            "type": "Soft Skills",
            "instructor": [],
            "instructor_link": [],
            "semester": 0,
            "content": {
                "courseAims": "This course aims to equip students with the necessary philosophical foundations to understand theories of ethics and subsequently apply those theories to real -life scenarios and issues. It also aims to enable students to understand and critically assess th e civic institutions that structure their local and global communities. To these ends, the course will examine the nature of ethics, its understanding across different cultures, and how it is manifested in concepts, social structures, and governance instit utions.\n\nTopics to be explored include human rights, democracy, freedom of speech  and inequality. The rights and duties of citizenship shall be a unifying theme. Students will think through assumptions they hold on all of these matters. They will be provided with the tools to understand various and even contradictory perspectives on these important issues. There will be a substantial amount of time devoted toward understanding Singapore’s own institutions and ideologies, which are of course products specific to the country’s own unique historical and geo -political circumstances. We expect t hat students will have a better appreciation of the country’s institutions after reading the module.",
                "ilo": "By the end of this course, you should be able to:\n1. Identify the morally relevant features of situations, decisions, and policies;\n2. Explain your moral responsibilities to actively participate in activities that strengthen your local and global communities;\n3. Critically assess th e civic structures and institutions of your communities and your role in them;\n4. Make well -informed arguments on some major contemporary issues.\n5. Apply ethics and civics concepts to the Singapore context.",
                "courseContent": "1. Introduction – What is Ethics, Civics, Multiculturalism and how is this relevant to you?\n2. Reasoning for ethics and civics + Logic Quiz\n3. Human Rights Part 1: Human Trafficking\n4. Human Rights Part 2: Disability\n5. Reproduction Ethics : Abortion\n6. Ethics of Death and Dying : Euthanasia and Assisted Suicide\n7. Equality & Meritocracy\n8. Multicultralism\n9. Political Systems: Types, Features, and Moral Justifications\n10. Free Speech: Meanings, Limitations, and Implications",
                "courseReference": "1. Russ Shafer-Landau, “What is Morality?” pp. 1-6 from Living Ethics (US: Oxford University Press, 2019).\n2. Al-Farabi, excerpts from “The Attainment of Happiness” pp. 113-119 from Introduction to World Philosophy(US: Oxford University Press,2009).\n3. Teo You Yenn, This is What Inequality Looks Like, pp. 41-90 (Singapore: Ethos Books, 2018)."
            }
        },
        {
            "code": "CC0005",
            "title": "Healthy Living & Wellbeing",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/default-source/default-document-library/inspire/cc0005-outline-ay2021-s2.pdf",
            "aus": 3,
            "type": "Soft Skills",
            "instructor": [],
            "instructor_link": [],
            "semester": 0,
            "content": {
                "courseAims": "This course aims to provide multi -disciplinary competence in a cross -disciplinary, collaborative learning environment, with student interaction and collaboration across schools as a key learning foundation.  As the title connotes, the main objective of this compulsory undergraduate course is to examine what constitutes living a good, healthy, and flourishing life.\n\nIt provides students with the building blocks to thrive – physically and mentally – in their everyday lives. Students will gain knowledge and skills to develop a physically healthy lifestyle, enhance their awareness of prevalent mental health issues, and b e equipped with resources and tools to cope with common situational challenges.\n\nBy the end of the course, students should also have a deeper appreciation of how physical and mental health are intricately linked.",
                "ilo": "By the end of this course, you should be able to:\n1. Describe what healthy living and wellbeing means to you as an undergraduate student.\n2. Identify common health and mental issues (including knowing the sources of help) in Singapore and how this knowledge would benef it you and the people around you.\n3. Demonstrate coping strategies for developing resilience and self -care, playing an active role in living a healthy and meaningful life.\n4. Explain and distinguish between healthy and toxic relationships and apply mitigating skills to resolve relational conflicts.\n5. Recognize the importance of self -determination, values -based actions, wisdom, and creativity in the pursuit of personal growth and self -actualization.\n6. Explain health and mental health care issues at a glo bal level, in relation to understanding national policies and other related matters.\n7. Collaborate effectively on health and wellbeing issues in cross -disciplinary teams.",
                "courseContent": "This course will cover the following topics:\n1. The body -mind -spirit connection for healthy living and wellbeing\n2. Health and Nutrition\n3. Health and Fitness\n4. Health and Disease\n5. Health and Maturation\n6. Health and Wholeness in  Building Resilience\n7. Understanding Stress and Fostering Self-care\n8. Building Mental Health Awareness and Resources\n9. Nurturing Healthy Relationships and Social Wellness\n10. Aspiring Personal Growth and Self-actualization\n11. Cultivating Wisdom and Creativity for a Flourishing Life",
                "courseReference":"1. Teague, M., Mackenzie, S., & Rosenthal, D. (2021). Your health today: Choices in a changing society. "
            }
        },
        {
            "code": "MS1018",
            "title": "Properties of Materials",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms1018-properties-of-materials.pdf",
            "aus": 2,
            "type": "Core",
            "instructor": [
                "Tan Kwan Wee",
                "Hng Huey Hoon"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00165",
                "https://dr.ntu.edu.sg/cris/rp/rp00313"
            ],
            "semester": 0,
            "content": {
                "courseAims": "The main aim of this course is to further correlate the structure of materials to their electrical, thermal, optical and magnetic properties. The course will highlight the importance of careful design of the materials structure to harness the associated properties in real application examples. Understanding of these relationships helps you to achieve different functional properties in a given materials combination/system for a specific application that is necessary for a materials engineer.",
                "ilo": "By the end of this course, you (as a student) would be able to:\n1. Explain the electrical properties of materials based on band theory .\n2. Apply calculations to determine the electrical conductivity of metals and semiconductors.\n3. Evaluate BH curves of magnetic materials.\n4. Determine the thermal properties of materials based  on their density, bond strength and types of bond.\n5. Determine optical properties of solid materials based on the materials classes, crystal structures and bonds .\n6. Evaluate the link between materials structure and their associated properties.",
                "courseContent": "1.\tBand Structures of Materials\n- Electron wave-particle duality, Schrodinger equation, Free electron model, Brillouin zones, Energy band structures\n\n2.\tElectronic Properties of Materials\n- Electronic states, band gaps and their interpretation\n- Electronic structure of semiconductors, semiconductor devices\n- Electromagnetic theory / waves in materials\n\n3.\tMagnetic properties of materials\n- Magnetization in materials, origin of magnetism in materials, magnetic domains, differences among para-, ferro-, and ferri-magnets\n- Modern applications: spintronics, Skyrmions\n\n4.\tThermal properties of materials\n- Thermal conductors and insulators, mechanisms in different classes of materials (thermal conductivity, convection, radiation)\n- Thermal stability and service temperatures\n- Influence of thermal properties on end applications, e.g., thermoelectrics, thermal energy storage\n\n5.\tOptical properties of materials\n- Interactions with light – Absorption, Reflection, Transmission, Refractions, Reflective indices, Photonic bandgaps and devices\n\n6.\tLaboratory Sessions:\n- Hall measurements, multimeter measurements of metals, polymers, transparent conductive glass substrates, graphitic networks on polyimide",
                "courseReference":"Suggested reading:\n\n - Materials Science and Engineering, 10th Edition, SI Version, Willian D. Callister, David G.Rethwisch, 2018, John Wiley & Sons Inc.\n\nAdditional reading:\n\n- Introduction to Materials Science for Engineers, James F. Shackleford, 8th Edition, Global Edition Pearson.\n- S. M. Sze, Semiconductor Devices: Physics and Technology, 2nd Edition, Wiley (2006)\n- Robert Pierret, Semiconductor Device Fundamentals, Pearson (1996)"
            }
        },
        {
            "code": "MS1008",
            "title": "Introduction to Computational Thinking",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms1008.pdf",
            "aus": 3,
            "type": "Core",
            "instructor": [
                "Zhao Yang"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00682"
            ],
            "semester": 0,
            "content": {
                "courseAims": "Computational thinking (CT) is a problem solving process with the aid of computer; i.e. formulating a problem  and expressing its solution in such a way that a computer can effectively carry it out. It includes a number of characteristics, such as breaking a problem into small and repetitive ordered steps, logically ordering and analyzing data and creating solutio ns that can be effectively implemented as algorithms running on computer. As such, computational thinking is esse ntial not only to the Computer Science discipline, it can also be used to support problem solving across all disciplines, including math, scien ce, engineering, business, finance and humanities.\n\nThe aim of this course is hence to take  you especially students with no prior experience of thinking in a computational manner to a point where you can derive simple algorithms and code the programs to solve some basic problems in their domain of studies. In addition, the course will include topics to appreciate th e internal operations of a processor, and raise awareness of the socio-ethical issues arising from the pervasiveness of computing technology.",
                "ilo": "Upon the successful completion of this course, you shall be able to:\n1. Describ e the internal operation of a basic processor, how a program is executed by a computer and computing trends.\n2. Code basic programs based on the programming language used in the course\n3. Formulate a problem and express its solution in such a way that a computer can effectively carry it out. (i.e. equip you with CT skills)\n4. Apply the CT concepts on case studies/problem -based scenarios through hands-on practice of the CT processes.",
                "courseContent": "1. Course Overview and Concepts of Computational Thinking: Solving complex problem using computer - enables the student to work out exactly what to tell the computer to do.\n2. Overview  of Programming Languages: Graphic programming, high level programming languages (Python, C, Java, R, Matlab)\n3. Basic internal operation of computer: Basic computer organization (Processor, Memory, I/O) and how a computer execute a program (Machine instructions)\n4. Basic program structure: control constructs and data types: Concepts of data types, variables; Pseude code and flowcharts; Sequences, Selection (if/else), iteration (for/while loop);\n5. CT concept - Abstraction: Problem formulation - reducing something to a very simple set of characteristics to only focusing on the most relevant to the problem. Concept of functions/libraries  and data structure\n6. CT concept - Decomposition: Break a complex problem into smaller and more manageable parts/steps, such that  each of these smaller problems can then be looked at individually\n7. CT concept – Pattern recognition: Looking for similarities among and within problems, which also enable re-use knowledge of previous similar problems\n8. CT concept – Algorithm: Reformulating the problem into series of ordered steps through Identifying, analyzing, and implementing possible solutions with the goal of achieving the most efficient and effective combination of steps and resources. (Some common/useful examples: Sorting and searching)\n9. Limit of computing: Analysis of Algorithm Complexity to determine how much resources (space and time) are needed to execute an Algorithm in order to achieve code optimization.\n10. Computing Trends: Cloud, Edge and Fog computing, Quantum Computers\n11. Social-Ethical Issues and Ramifications of Computing: Fairness, Privacy, Sharing, Hacking, software Piracy, Data Protection, Cyberbullying and trolling, Fake news, digital divides, IP/Copyright",
                "courseReference": "The course will not use any specific text book. The following books and websites will be used as reference materials.\n1.The Practice of Computing using Python; William Punch and Richard Enbody, Pearson, 2017.\n2.Introduction to Computation and Programming Using Python: With Application to Understanding Data; (2nd Ed) John V. Guttag, MIT Press Ltd, 2016.\n 3.https://edu.google.com/resources/programs/exploring-computational-thinking/"
            }
        },
        {
            "code": "MS2013",
            "title": "Introduction to Polymer Science",
            "coreq": [
                "MS1014",
                "MS1016"
            ],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms2013_polymers_and_composites.pdf",
            "aus": 3,
            "type": "Core",
            "instructor": [
                "Hu Xiao",
                "Yu Jing"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00790",
                "https://dr.ntu.edu.sg/cris/rp/rp00432"
            ],
            "semester": 0,
            "content": {
                "courseAims": "This is an advanced introductory level course, which is aimed to provide fundamental and also specialized knowledge in polymer science for Materials Engineering students. This course covers essential topics in both chemical and physical aspects of polymers.",
                "ilo": "By the end of this course, you (as a student) should be able to :\n1. Describe basic concept and classification of polymers, and their applications.\n2. Understand the concept of molecul ar weight and molecular weight distribution; Explain and calculate  molecular weight and distribution of  polymers, and explain and illustrate methods of measurement of molecular weight\n3. Understand the basic principles of polymerization; Describe the basic and essential steps of different polymerization methods; Discuss and contrast their mechanisms and analyze kinetics of step growth and chain growth (free radical and ionic polymerization)\n4. Understand copolymer and copolymerization, and the concept of composit ion drift and composition control; Be abreast with the broader aspect and recent advances in polymerization\n5. Describe the basic chain conformations of polymers in solution.\n6. Understand the concept of viscosity of polymer solutions. Describe the basic principles of characterizing the molecular weight of polymers using size exclusion chromatography.\n7. Understand the basic thermodynamic principles of polymer solutions; discuss the polymer-solution interactions using the Flory-Huggins theory; explain and calculate the osmotic pressure of polymeric solutions.\n8. Distinguish amorphous and semi-crystalline polymers and evaluate the implications; define the important thermal transitions of polymers and the factors affecting the transitions.\n9. Illustrate the measurements of thermal transitions.\n10. Discuss the unique viscoelastic properties of polymers and the basic models.",
                "courseContent": "Polymer Chemistry:\n\n1. Overview of polymers\n- Classes, types and applications of common polymers\n- Molecular weight and molecular weight distribution\n\n2. Step-growth polymerization\n- Condensation polymerization\n- Qualitative and quantitative discussion\n\n3. Chain-growth polymerization\n- Overview of polymerization techniques\n- Free radical polymerization\n- Ionic polymerization\n- Copolymer and copolymerization\n\n4. Selected recent advances in polymer chemistry\n- Grubbs ring opening metathesis polymerization\n- Controlled radical polymerization\n- Polymerization of conducting polymers\n- UV polymerization towards 3D printing\n- Dynamic bonding towards self-healing\n- Depolymerization towards plastic recycling\n\n\nPolymer Physics:\n5. Polymer conformations in solution\n- Average end-to-end distance for freely jointed chains\n- Freely rotating chains\n- Radius of gyration\n- Solvent quality\n\n6. Dynamics of dilute polymer solutions\n- Viscosity of polymer solutions\n- Intrinsic viscosity and Mark-Houwink Equations\n- Hydrodynamic radius\n- Size exclusion Chromatography\n- Thermodynamics of polymer solutions\n\n7. Thermodynamics of regular solution\n- Flory-Huggins theory\n- Osmotic pressure\n\n8. Glass and melting transitions\n- Amorphous and crystalline polymers\n- Melting temperature\n- Glass transition temperature\n- Factors affecting Tg\n- Measurement of Tg and Tm.\n\n9. Linear viscoelasticity\n- Viscoelasticity of polymers\n- Creep and stress relaxation\n- Models for polymer linear viscoelasticity",
                "courseReference":"1.RJ Young and PA Lovell. (2011). Introduction to Polymers, 3nd Edition, CRC Press\n2.SL Rosen. (1993). Fundamental Principles of Polymeric Materials, 2nd Edition, John Wiley\n3.https://pslc.ws/macrog/level4.htm\n4.Other reading material and online resources may be given specific to each selected topics."
            }
        },
        {
            "code": "MS1014",
            "title": "Materials Chemistry 2",
            "coreq": [
                "MS2013"
            ],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms1014_materials_chemistry_ii.pdf",
            "aus": 2,
            "type": "Core",
            "instructor": [
                "Lu Xuehong",
                "Ng Wei Tat, Leonard"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00263",
                "https://dr.ntu.edu.sg/cris/rp/rp01299"
            ],
            "semester": 0,
            "content": {
                "courseAims": "The aim of the course is to provide you with fundamental understanding of basic organic chemistry, including polymer chemistry, surfactant chemistry and inorganic chemistry, including reactivity of metals and non -metals and their compounds including metal coordination complexes.",
                "ilo": "By the end of this course, you (as a student) would be able to:\n1. Identify the nomenclature, bonding and structure of organic compounds;\n2. Predict physical properties of organic compounds from their molecular structures;\n3. Predict chemical reactions of organic compounds from their molecular structures and write chemical equations;\n4. Predict products of organic reactions based on reaction mechanisms covered in this course;\n5. Compare reactivities of metals based on their electronic structures and suggest appropriate methods for their production.\n6. Interpret properties of inorganic compounds based on periodic relationships among the elements.\n7. Identify structural features of transition metal complex ions and coordination compounds and predict their optical properties",
                "courseContent": "It introduces basic chemistry concepts and theories that are important for understanding of structures, properties and applications of materials. The organic chemistry part covers basic chemistry concepts and theories about organic molecules as well as nomenclature, structures and reactions of common organic compounds. Structures and properties of polymers, are also introduced briefly. The inorganic chemistry part includes an introduction to basic chemistry concepts, atomic orbital theory, periodic relationships among the elements, and chemistry of metals, non-metallic inorganic compounds and coordination compounds.",
                "courseReference":"1.Robert C. Atkins, Francis A. Carey, Organic Chemistry: A Brief Course, 3rd Edition, McGraw-Hill, Inc, 2002.\n2.TWG Solomons and CB Fryhle, Organic Chemistry, 9th Edition, John Wiley and Sons Inc., 2008\nChang, Raymond, Chemistry, 11th Edition, McGraw-Hill, 2012 (Call no.: QD31.2.C456 2013)."
            }
        },
        {
            "code": "EG1001",
            "title": "Engineer & Society",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/eg1001_engineers_in_society.pdf",
            "aus": 3,
            "type": "Core",
            "instructor": [],
            "instructor_link": [],
            "semester": 0,
            "content": {
                "courseAims": "This course aims to provide a general understanding of the society we live in and the engineers’ roles and responsibilities towards society’s well-being. The course is part of broadening education objective in the engineering curriculum. The course covers a wide range of topics including the h istory of engineering, engineering ethics and practices, sustainability, and contributions by engineers towards society in the future. The students will have a holistic understanding of the role played by engineers and on their impact in society.",
                "ilo": "By the end of this course, you (as a student) would be expected to be able to:\n1. Illustrate the role engineers play in the development of Singapore and future challenges,\n2. Interpret the significance of professional ethics,\n3. Interpret the significance of engineering practice in safety and sustainability, and\n4. Evaluate the contributions of engineers towards society and potential challenges.",
                "courseContent": "1 History of engineering\n2 Engineering ethics\n3 Engineering practice in Singapore (WSH)\n4 Engineering practice in Singapore (Sustainability)\n5 Contribution of Engineers in the Future\n6 Impact of Engineers in society (by external speakers)",
                "courseReference":"1.Johnson Stephen F, Gostelow J Paul and King W Joseph, Engineering and society: challenges of professional practice, Prentice Hall, 2000. (TA157, J73)\n2.National Academy of Engineering, The Engineer of 2020: Visions of Engineering in the New Century. (ISBN 978-0-309-09162-6 | DOI 10.17226/10999)\n3.Peter M Senge, The Fifth Discipline: The Art & Practice of The LearningOrganization, Doubleday, 2006. (ISBN 0-383-51725-4)"
            }
        },
        {
            "code": "CC0001",
            "title": "Inquiry and Communication In a Interdisciplinary World",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/default-source/default-document-library/inspire/cc0001-outline-ay2021-s20ae1aefb-90e5-4758-bd81-ac4ffd9a63d9.pdf",
            "aus": 2,
            "type": "Soft Skills",
            "instructor": [],
            "instructor_link": [],
            "semester": 0,
            "content": {
                "courseAims": "Writing is a tool for thinking. Through the process of organising our thoughts into words, we often stumble upon ideas and figure out what we mean. At its best, this process yields new insights. One of the aims of this course is to give you this experience of discovering ideas through the process of writing.\n\nWhile you will have the opportunity to practise the genre conventions of your disciplin e later in your studies, this first common communication course is designed to help you form habits of thinking that will serve you across the university and even in the world outside the university. Taken by all first -year undergraduates, this foundationa l course will develop your written and oral communication skills, as well as your ability to read and analyse texts. It will help you to understand revision as integral to the process of composition, to convey your interpretations and ideas with confidence  and clarity, and to consider audience and purpose when you communicate.",
                "ilo": "Upon successful completion of the course, students should be able to:\n1. Closely observe and analyse texts and phenomena;\n2. Design questions or puzzles from engagement with a text that can motivate further exploration;\n3. Summarise, paraphrase, and quote from sources accurately and ethically;\n4. Compose complex arguments that build on the ideas of published authors as well as their o wn analysis and thinking;\n5. Express their ideas orally through both informal and formal presentations;\n6. Discover writing as a tool for thinking;\n7. Use peer and teacher feedback to revise their thinking and communication;\n8. Recognize audience and rhetorical situat ion as significant factors in communication.",
                "courseContent": "In this course, students will be asked to explore a topic for their own research. The choices are:\n1. a place in Singapore;\n2. a community within Singapore;\n3. their own writing practices.\n\nStudents will investigate their chosen topic by close observation, recording their observations, and finding interesting patterns or puzzles in what they observe. In class, students will practice how to come to a question to which they do not have an answe r, and, after a review of presentation skills, students will present their discoveries to the class. Eventually, students will be asked to find two sources that can help them compose an argument that responds to their question. The final goal is to draft a n op -ed (short for “opposite the editorial page”), a piece of writing usually found in a newspaper or magazine that expresses the author’s argument on a current topic. Students’ op -eds will be peer workshopped and revised substantially over two to three we eks. Students will also consult with their teacher and receive individual feedback on their draft. By the end of the semester, students will consider how to send their op -ed to a newspaper or online platform.",
                "courseReference":""
            }
        },
        {
            "code": "CC0002",
            "title": "Navigating the Digital World",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/default-source/default-document-library/inspire/cc0002-outline-ay2021-s2.pdf",
            "aus": 2,
            "type": "Soft Skills",
            "instructor": [],
            "instructor_link": [],
            "semester": 0,
            "content": {
                "courseAims": "With digitali sation now becoming the new normal in our daily life, this course seeks to equip students from different disciplines with problem‐solving techniques with the aid of computers and to enable them to acquire common but  essential digital skil ls that are crucial in today’s workforce.\n\nIn this course, students will learn how to apply the concept of computational thinking and quantitative reasoning to solve problems and analyse data. They will also learn how to identify online threats and understa nd the principles of ethics and intellectual property rights in the digital world. Students will also be exposed to current issues in the digital world, such as cybersecurity and the rise of fake news. In addition, students will also learn how to use some of the latest online tools for effective presentation, communication, and collaborative skills in teams during the course.",
                "ilo": "By the end of this course, students should be able to:\n1. Apply structured approaches to solve complex problems by breaking them into sub‐problems.\n2. Apply quantitative reasoning to analy se data, guide problem -solving, and support decision‐making.\n3. Use digital tools and technologies to search for, assess, analy se, develop, and share digital content and solutions through different media forms.\n4. Interact and collaborate through digital platforms/channels.\n5. Demonstrate use of digital technology and online presence responsibly, ethically, legally, and with care.\n6. Describe current developments and issues in the digital world.",
                "courseContent": "This course will cover the following topics:\n1. Computational Thinking Problem -Solving  Techniques\n2. Quantitative Reasoning Techniques\n3. Managing Cybersecurity\n4. The World of Digital Misinformation\n5. Principles of Data Ethics in the Digital World\n6. Intellectual Properties, Rights and Da ta Privacy in the Digital World\n7. Latest and Emerging Technology Trends",
                "courseReference": ""
            }
        },
        {
            "code": "MS2012",
            "title": "Introduction to Manufacturing Processes",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms2012_introduction_to_manufacturing_processes.pdf",
            "aus": 3,
            "type": "Core",
            "instructor": [
                "Yu Jing",
                "Liu Zheng"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00432",
                "https://dr.ntu.edu.sg/cris/rp/rp00616"
            ],
            "semester": 0,
            "content": {
                "courseAims": "This course aims to introduce you to various processes for the making and shaping bulk materials, polymer materials, and semiconductor materials processing.\n\nThe objective of this course is to familiarize with the conventional manufacturing processes such as metal working,  joining & cutting, casting, etc. and also the common processing steps in the polymer and microelectronics industry.",
                "ilo": "By the end of the course, you should be able to:\n1. Explain the basic concepts, mechanisms, design and applications of Metal Forming, and its role in Manufacturing Processes.\n2. Apply basic concepts of alloy solidification to commercial casting processes and predict microstructures and element segregation.\n3. Design components for manufacture by casting; avoid shri nkage.\n4. Choose a suitable casting process for a given component depending on the shape, material, application requirements and production volume.\n5. Identify the role of machining in manufacturing and the importance of cutting tool materials.\n6. Describe non-conventional machining processes.\n7. Explain basics of concepts of thermoplastic and thermoset polymers.\n8. Compare basics concepts, mechanisms, and applications of polymer processing techniques.\n9. Describe basics principles of vacuum techniques and thin film deposition techniques, and their roles in manufacturing processes.\n10. Apply basics concepts and steps of electronic materials manufacturing processes.",
                "courseContent": "Fundamentals of casting and overview of casting processes. Fundamentals of metal deformation and overview of metal deformation processes. Machining and cutting of materials. Overview of polymer processing and electronics materials processing. Vacuum deposition processes. Basics of electronic material processing.",
                "courseReference": "-Kalpakjian S and Schmid SR, Manufacturing Engineering & Technology, Prentice Hall, 7th Ed,2014.\n-Groover MP, Principles of Modern Manufacturing, Wiley International, Fifth Edition., 2013"
            }
        },
        {
            "code": "MS2016",
            "title": "Introduction to Metallurgy",
            "coreq": [],
            "prereq": [
                "MS1016",
                "MS1017",
                "MS1018"
            ],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms2016_introduction_to_metallurgy.pdf?sfvrsn=e211ec91_9",
            "aus": 2,
            "type": "Core",
            "instructor": [
                "Aravind Babu Dasari",
                "Ali Miserez"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp01054",
                "https://dr.ntu.edu.sg/cris/rp/rp00592"
            ],
            "semester": 0,
            "content": {
                "courseAims": "The fundamental understanding of phase transformations in materials is the key for tuning their structure and properties. This course will provide the necessary basic knowledge to relate bonding, diffusion, and temperature (heat treatment) in solids to their evolution of structure (covering aspects of interphase movement and solidification). Emphasis will also be on the  thermodynamic concepts behind these different phenomena.",
                "ilo": "By the end of this course, you (as a student) would be able to:\n1. Predict the properties and interactions of different materials by understanding their composition, making connections to structure and bonding.\n2. Explain the different types of imperfections in solids (metallic and ionic) and their influence on properties.\n3. Identify carbon sites (interstitial positions – octahedral and tetrahedral) in both α− and γ− iron lattices; illustrate the importance of strain energy in choosing the correct interstitial site; explain the symmetric and asymmetric distortion\n4. Calculate the effect of temperature on vacancy formation and the rate at which they move in a lattice.\n5. Explain and analyse Hume-Rothery rules that govern the formation of solid solutions.\n6. Apply Fick’s first and second laws for solid state diffusion in binary systems; to solve fundamental and industry-oriented problems and recognize the significance of diffusion coefficient D.\n7. Explain the importance of interfacial energy and its influence on grain shape as well as grain boundary migration and pinning force concepts.\n8. Describe the driving forces for growth of a pure solid or alloy after nucleation.\n9. Explain the concepts of constitutional undercooling, solute pile-up at the solid-liquid interfaces, differences between columnar and equiaxed solidification, formation of dendrites, and eutectic solidification.\n10. Analyse the implication of nucleation and nucleation rate in relation to Gibbs free energy requirements.",
                "courseContent": "L1: Imperfections in Solids\n L2: Imperfections in Solids\n L3: Diffusion\n L4: Diffusion\n L5: Thermodynamics of Interface\n L6: Thermodynamics of Interface\n L7: Solidification\n L8: Solidification",
                "courseReference":"Suggested reading:\n\n- Phase Transformations in Metals and Alloys, 3rd edition, David A Porter, Kenneth E Easterling, Mohamed Sherif, PUB Feb 2009, CRC Press.\n -Fundamentals of solidification, W. Kurz and D.J. Fisher, Trans Tech Publications, 4th Edition,1998."
            }
        },
        {
            "code": "MS2083",
            "title": "Laboratory on Structure-Property Relationship in Polymers",
            "coreq": [],
            "prereq": [
                "MS2013"
            ],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms2083_laboratory_on_structure-property_relationship.pdf",
            "aus": 1,
            "type": "Core",
            "instructor": [
                "Aravind Babu Dasari"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp01054"
            ],
            "semester": 0,
            "content": {
                "courseAims": "To understand the influence of molecular weight on thermal and mechanical properties of polymers.\nSpecifically:\n1. To characterize the hydrodynamic size, virial coefficient and estimate the molecular weight using dynamic light scattering (DLS) technique.\n2. To understand the concepts behind light scattering technique and Zimm plot.\n3. To compound different molecular weight polystyrene (PS) and prepare tensile specimens.\n4. To perform differential scanning calorimetry (DSC), thermogravimetric analysis (TGA) and tensile testing on specimens of different molecular weight.\n\nTo explain the differences observed in the data between the two grades of PS.\nWhat are the underlying theories/concepts?\n1. Brownian motion, random walk analysis, polymer solutions (good, poor, theta conditions, Flory-Huggins theory, and UCST/LCST conditions)\n2. Characterization of molecular weights and importance.\n3. Importance of structural features of polymers and their influence on properties.",
                "ilo": "By the end of this course, you (as a student) would be able to:\n1. Obtain a deeper understanding of some of the concepts that are taught during the course work by using the state-of-the-art scientific equipment and getting hands-on exposure.\n2. Understand the laboratory and safe working protocols.\n3. Improve skills required for scientific problem solving by establishing the problem, formulating the hypothesis, recording the observations, and interpreting/analyzing the experimental data in a comprehensive manner.\n4. Experience team learning and responsibility to complete tasks.\n5. Effectively communicating the data in writing form.",
                "courseContent": "1. Demonstration videos and lecture on the concepts behind the content to be dealt in this module, basic principles of different equipment that will be used in the module.\n2. Hands-on training on the above-mentioned machines.\n3. Dynamic light scattering analysis of the polymer solutions to determine the conformational changes/hydrodynamic size, virial coefficients and molecular weights.\n4. Differential scanning calorimeter (DSC) analysis of the different molecular weight polystyrene to differentiate the crystalline/amorphous nature, and other thermal transitions like glass transition temperatures (Tg).\n5. Optical/chemical properties of the processed systems by utilizing the spectroscopy.\n6. Thermogravimetric analysis (TGA) to understand the thermal stability differences between the high- and low-molecular weight PS. Tensile testing of the polymers to connect the structural and chemical aspects of the materials to mechanical performance.",
                "courseReference":"1.Joel R. F, Polymer Science and Technology, 3rd Edition, Prentice Hall, 2014\n2.Sperling L. H, Introduction to Physical Polymer Science, 4th Edition, Wiley, 2005.\n3.Young R. J, Introduction to Polymers, 3rd Edition, CRC Press, 2011\n4.Gedde U. W, Hedenqvist M. S, Fundamental Polymer Science. Germany: Springer Internationl.Publishing, 2019. ISBN: 9783030297947\n5.Lodge T. P, Hiemenz P. C, Polymer Chemistry. United Kingdom: CRC Press, 2020. ISBN:9781466581654."
            }
        },
        {
            "code": "MH2811",
            "title": "Mathematics 2",
            "coreq": [
                "MH1810"
            ],
            "prereq": [
                "MH1810"
            ],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider123/obtl/mas/updated-obtl/mh2811-spms-eng-outcomes-based-teaching-and-learning-document-(obtl)-28th-nov-2022.pdf?sfvrsn=6a65662d_3",
            "aus": 3,
            "type": "Fundamental Math and Sciences",
            "instructor": [],
            "instructor_link": [],
            "semester": 0,
            "content": {
                "courseAims": "This course prepares students for the solution and interpretation of practical problems encountered in engineering disciplines with emphasis given to strengthening your problem- solving abilities. This course is target at second year MSE students, and aims at equipping MSE students with the necessary mathematical knowledge in Materials Science and Engineering applications.",
                "ilo": "Upon successfully completing this course, you should be able to:\n1. Apply the methods taught to solve for the Fourier series of a given periodic function.\n2. Calculate the Fourier integral of a given function\n3. Describe the use of the partial derivative and relate it to slopes and gradients, and the use of the directional derivative\n4. Apply the chain rule to solve for the partial derivative of functions with multiple levels of dependent parameters\n5. Describe the formal definition of the double integral\n6. Calculate volumes via the double integral\n7. Demonstrate the ability to reverse the order of a given double integral\n8. Solve first order ordinary differential equations of the separable, linear and exact types\n9. Solve second order linear ordinary differential equations with constant coefficients\n10. Perform the method of separation of variables to derive the solution to a given partial differential equation\n11. Provide the solution for a given heat or wave equation\n12. Derive the different parametric forms of a given line curve or a surface\n13. Apply Green's Theorem to solve a given integral\n14. Calculate the line integral of a given scalar function, and a given vector field\n15. Solve for the surface integral of a given scalar function, and a given vector field\n16. Provide interpretations of the line integral and the surface integral of a given function\n17. Apply conservation of a vector field to solve for the line integral and explain the meaning in terms of work done",
                "courseContent": "Fourier series\nFourier integrals\nPartial differentiation\nThe chain rule for partial derivatives\nDouble integrals\nReversing the order of integration\nOrdinary differential equations\nPartial differential equations, wave and heat equations\nVector fields, curl, divergence\nLine integrals and surface integrals\nParameterizing a surface or line curve\nGreen's Theorem\nConserved vector fields",
                "courseReference":"Advanced Engineering Mathematics, by Kreysgiz E, 9th or 10th edition, John Wiley & Sons.ISBN: 978-0470646137\nCalculus, by Thomas, Weir and Hass, published by Pearson. 13th edition. ISBN:9780321878960"
            }
        },
        {
            "code": "CC0007",
            "title": "Science & Technology for Humanity",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/default-source/default-document-library/inspire/cc0007-outline-ay2022.pdf",
            "aus": 3,
            "type": "Soft Skills",
            "instructor": [],
            "instructor_link": [],
            "semester": 0,
            "content": {
                "courseAims": "The course aims to inspire a long-lasting mindset of awareness, critical thinking, curiosity, and collaboration across disciplines through the lens of contemporary and near-future  challenges for human communities in relation to scientific and technological innovations.\n\nStudents will learn to perceive and analyse the potential benefits and costs of scientific/technological innovations and applications from different perspectives and on different scales. Students will then use these skills to identify real-life challenges and to propose solutions.",
                "ilo": "Upon the successful completion of this course, you (as a student) will be able to:\n1. (Content) Describe the basic scientific/technical principles of the featured cutting-edge fields/innovations; the kinds of human problems/challenges that these are meant to address; and the additional problems/challenges posed in and by their application.\n2. (Interdisciplinary) Describe and analy se connections between, three general classes of perspectives on the challenges of innovation and application: scientific/technical, business, and humanistic/social scientific perspectives\n3. (Critical thinking) Identify, critique, and evaluate ethical, financial, organisational, legal, social, and cultural components surrounding the application of technological innovations.\n4. (Problem solving) Identify and present possible innovations and solutions for their application that would achieve a consensual balance between scientific-business-social concerns.\n5. (Team) Collaborate effectively on project development in cross-disciplinary teams.",
                "courseContent": "Topics to be covered in the course:\n1. Ways in which Science and Technology can be understood as being for Humanity .\n2. 3 Perspectives on the relations Science-Humanity: Science/Tech, Business, Humanities/Social Science (i.e. Innovation, Application, Impact).\n3. Introduction of “Circular model” for thinking about Science-Humanity/Humanity-Science relations (Why and how humans make science? How and why science impacts humans?).\n4. Application of circular model through major humanistic themes (e.g. life, equality, prosperity) with respect to applications of specific technological examples.\n5. Detailed consideration of scientific-business-social challenges related to at least three major fields of cutting-edge scientific and technological development (e.g. Artificial intelligence, Data Analytics, Metaverse, Synthetic Biology)."
            }
        },
        {
            "code": "MS2018",
            "title": "Electronic & Magnetic Properties of Materials",
            "coreq": [
                "MS1017",
                "MS1018"
            ],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms2018_electronic_and_magnetic_properties_of_materials.pdf",
            "aus": 3,
            "type": "Core",
            "instructor": [
                "Liu Zheng"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00616"
            ],
            "semester": 0,
            "content": {
                "courseAims": "This is an introductory course on solid state physics for the second-year undergraduate students. The objective is to provide a theoretical framework for understanding the electrical, dielectric and magnetic properties of various materials. This course exp oses the students to theories relevant to the engineering principles of various materials and devices. The materials design of an electronic or magnetic device is based on the understanding of these basic concepts.",
                "ilo": "By the end of the course, you should be able to:\n1. Describe the behaviours of an electron under classical theory of metals and derive the conductivity from Drude model. Analyse Hall effect and thermal conductivity based on the classical theory of metals.\n2. Illustrate the wave -particle duality and be able to apply it to electrons;\n3. Interpret Schrodinger equation and the physical meaning of each terms in Schrodinger equation. Apply Schrodinger equation to describe the behaviours of an electron at 1-D inf inite potential well.\n4. Analyse the atomic structure, electron filling at different atom shells. Estimate the physical/chemical properties of different elements based on the electron configuration at the shells.\n5. Clarify the concepts of energy state, Fermi level, effective mass, E-k Relationship and band gap. Derive these values from Sommerfeld theory of metals.\n6. Differentiate the intrinsic, n- and p-type semiconductor. Deduce the semiconductor parameters e.g. carrier concentration, dopant level an d conductivity of intrinsic and extrinsic semiconductors with different dopants.\n7. Differentiate Ohmic and Schottky contacts. Illustrate the band diagrams of PN junctions and MOSFET. Derive a few key parameters such as current density and depletion region length.\n8. Describe the polarization, relative permittivity, dielectric constant and loss, strength in dielectric materials. Compare insulation and describe dielectric response.\n9. Deduce the electronic dipoles in dielectric materials. Apply Gauss’ Law  to describe the dielectric breakdown. Clarify the nature of piezoelectricity, ferroelectricity and pyroelectricity.\n10. Interpret the origin of magnetic properties. Differentiate different type of magnetic properties: diamagnetic, paramagnetic, ferromagne tism, antiferromagnetic and ferrimagnetic.\n11. Clarify magnetizing field and magnetization. Illustrate magnetic domains and M vs H behaviour. Describe the potential applications of magnetic materials.",
                "courseContent": "Classical theory of metal; Introduction to quantum mechanics; Modern theory of metals; Semiconductors and semiconductor devices; Dielectric materials; Magnetism and magnetic materials.",
                "courseReference":""
            }
        },
        {
            "code": "MS0003",
            "title": "Introduction to Data Science and Artificial Intelligence",
            "coreq": [],
            "prereq": [
                "SC1003",
                "BG2211",
                "CH2107",
                "CV1014",
                "MS1008",
                "MA1008",
                "EE1005",
                "RE1016"
            ],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms0003-introduction-to-data-science-and-artificial-intelligence.pdf",
            "aus": 3,
            "type": "Foundational Core",
            "instructor": [
                "Kedar Hippalgaonkar",
                "Ng Wei Tat, Leonard"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00405",
                "https://dr.ntu.edu.sg/cris/rp/rp01299"
            ],
            "semester": 2,
            "content": {
                "courseAims": "In today's era of Information, ‘Data’ is the new driving force, provided we know how to extract relevant ‘Intelligence’. This course will start with the core principles of Data Science, and will equip you with the basic tool and techniques of data handling , exploratory data analysis, data visualization, data-based inference, and data-focussed communication. The course will also introduce you to the fundamentals of Artificial Intelligence – state space representation, uninformed search, and reinforcement learning.\n\nThe course will motivate you to work closely with data and make data-driven decisions in your field of study. The course will also touch upon ethical issues in Data Science and Artificial Intelligence, and motivate you to explore the cutting-edge applicati ons in Materials Science related to Big Data, Neural Networks and Deep Learning. Python will be the language of choice to introduce hands-on computational techniques.",
                "ilo": "By the end of this course, you (as a student) would be expected to be able to:\n1. identify and define data-oriented problems and data-driven decisions in real life,\n2. discuss and illustrate the problems in terms of data exploration and visualization,\n3. apply basic machine learning tools to extract inferential information from the data,\n4. compose an engaging “data-story” to communicate the problem and the inference,\n5. outline the roles and requirements of artificial intelligence in practical applications,\n6. discuss and explain fundamentals of state space search and reinforcement learning.",
                "courseContent": "1. Introduction - Data-Analytic Thinking. What is Data Science? – The core problems and solutions. Extracting Intelligence from Data – formulating problems.\n2. Basic Data Acquisition and Handling\n3. Basic Statistics and Exploratory Data Analysis\n4. Linear Regression\n5. Classification\n6. Clustering and Anomalies (CA 1)\n7. Visualization - Clustering and Anomalies\n8. Neural Networks - Visualization\n9. Large Language Models - Neural Networks & Large Language Models\n10. Time Series Modeling (CA2)\n11. Introduction to Real-Life Datasets (Project Lab I)\n12. Strategies for improved performance on project datasets I (Project Lab II)\n13. Strategies for improved performance on project datasets II (Project Lab III)",
                "courseReference":"There is no single textbook for the course. The following books and resources will be used as references and if necessary, notes will be provided.\n\n1. Python Data Science Handbook : Jake VanderPlas : O’Reilly (2016)\n2. An Introduction to Statistical Learning : James, Witten, Hastie, Tibshirani (2021)\n\nAdditional resources, if required, will be shared with you in the Lectures and Example Classes."
            }
        },
        {
            "code": "MS3082",
            "title": "Design Lab",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms3082_design_lab.pdf",
            "aus": 1,
            "type": "Core",
            "instructor": [
                "Terry W.J. Steele"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00611"
            ],
            "semester": 0,
            "content": {
                "courseAims": "Familiarize materials science students with concepts and digital tools in virtual design engineering.\nSpecifically:\n1. Operate computer aided design (CAD) software towards parts sketching and geometric.\n2. Draft part drawings in mul tiple views towards fabrication of outsourced prototypes.\n3. Arrange multiple part assemblies, analyze assembly clearances, and create exploded views.\n4. Evaluate and decide materials selections based on applied engineering function and associated loads.\n5. Dete rmine stress/strain measurements through simulations on part interfaces.\n6. Exploit ‘Design Intent’ tools to yield multifunctional products that have optimized material properties under defined loads and stresses. To explain the differences observed in the data between the two grades of PS.\n\nWhat are the underlying theories/concepts?\n1. Geometric Modelling\n2. Finite Element Analysis\n3. Simulation in Engineering Analysis\n4. Material Selection based on design intent\n5. Prototype via FDM 3D printing\n6. Iterative Virtual/P rototype Testing and Feedback",
                "ilo": "By the end of this course, you (as a student) would be able to:\n1. Impart basic skills towards computer aided engineering, geometric modelling, parts mating, and ASTM-based drafting.\n2. Establish and evaluate part engineering design with finite element modelling.\n3. Prioritize features for prototype design, review, and application -related evaluation.\n4. Demonstrate proficiency in a commercial CAD software widely used in engineering and manufacturing companies.\n5. Manage and exhibit the design stages required for virtual and physical prototypes.\n6. Apply advanced load/displacement simulations on part interfaces.\n7. Design stress/strain simulations for refining prototypes to specific applic ations.\n8. Convert virtual prototypes to physical models via 3D -printing.\n9. Evaluate deficiencies between virtual prototype vs. physical prototypes.\n10. Exhibit a CAD portfolio for resume building and future employment opportunities.",
                "courseContent": "1. Self-paced lectures on the concepts geometric modelling and 3D printings.\n2. Self-learning tutorials that cover the basics of basic part modelling, drawings, and assemblies within CAD-based geometric modeling.\n3. Simulations on part interfaces evaluating choice of materials and loads/displacement.\n4. Demonstrate 5 advanced simulation tutorials of concerning stress/strains, thermal properties, pressure fitting, plastics flow, and injection molds.\n5. Direct flow analyses to evaluate fluid and thermal dynamics.\n6. Training in 3D printing to build and evaluate physical product prototypes build in CAD software.\n7. Problem based learning group design collaborations solving real-world engineering scenarios.\n8. Students will also be directed to Matlab tutorials for self-learning and usage scenarios.",
                "courseReference":"As content is project-dependent, students are expected to seek references that are relevant to the projects assigned in the particular semester.\nSupplemental Textbook:\nShetty, D., Product Design for Engineers. Cengage Learning, Boston, MA, 2016. ISBN: 9781133962045"
            }
        },
        {
            "code": "MS2015",
            "title": "Mechanical Behaviour of Materials",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms2015_mechanical_behaviour_of_materials.pdf",
            "aus": 3,
            "type": "Core",
            "instructor": [
                "Dong Zhili",
                "Luciana Lisa Lao",
                "Nripan Mathews"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp01163",
                "https://dr.ntu.edu.sg/cris/rp/rp01244",
                "https://dr.ntu.edu.sg/cris/rp/rp00211"
            ],
            "semester": 0,
            "content": {
                "courseAims": "This course introduces basic concepts and principles behind statics and mechanics, material deformation, fracture, fatigue and creep. Calculations of loads/stresses and macro-mechanical properties will be correlated whenever possible to provide insights into materials fundamentals behind the observed behaviors. The ultimate goal is to enable you to apply these principles in materials design & selection under various mechanical conditions. This course should be taken by early stage materials science and engineering undergraduates as one of the core modules required to acquire fundamental understanding of materials behavior.",
                "ilo": "By the end of the course, you should be able to:\n1. Analyze force loading diagrams/pictures and construct Free -Body -Diagrams from them\n2. Formulate equations of equilibrium and solve them to determine unknown force components\n3. Calculate stresses and strains due to axial loads, torsion and bending\n4. Evaluate suitability of materials based on loading, mechanical property and geometric constraints\n5. Apply Mohr’s Circle for plane stress transformation and to determine principle stresses\n6. Determine the deformation field, under elastic regime, under a given state of constraint using the generalized Hooke law in tensorial formation.\n7. Determine the intensity and the direction of the principal forces under a given state of con straint and determine the deformation field along the directions of the principal forces, under elastic regime.\n8. Predict yield using the Tresca and von Mises yield criteria.\n9. Explain the deformation mechanism in the plastic regime, in 1D, including the micro -structural mechanism (dislocation sliding, grain sizes, impurities, etc).\n10. Model the deformation mechanism, 1D, using the law presented in the lectures (Ramberg -Osgood, Ludwik, etc models).\n11. Know about the experimental techniques to establish the stress -strain curves.\n12. Explain the deformation and fracture mechanisms of Creep.\n13. Estimate the crack propagation as function of time (be able to solve the equation).\n14. Calculate safety factors on stress, life and temperature, stress concentration.\n15. Explain the fatigue, f racture and toughness concepts.",
                "courseContent": "List of key topics taught\n1. Free-Body-Diagrams\n2. Two- and three-force members\n3. Equations of equilibrium\n4. Normal and shear stresses\n5. Load-displacement relationship due to axial loads\n6. Shear stress due to torsion\n7. Normal stress due to bending\n8. Stress transformation using Mohr’s Circle\n9. Introduction of the mathematical concepts needs for the lectures\n10. Elasticity\n11. Plasticity\n12. Viscosity\n13. Fatigue and Fracture\n14. Crack propagation and Toughness",
                "courseReference":"1. R.C. Hibbeler, Statics and Mechanics of Materials, Sixth Edition, 2023, Pearson, Hoboken\n2. W. M. Hosford, Mechanical Behavior of Materials, Second Edition, 2010, Cambridge University Press\n3. N. E. Dowling, Mechanical behavior of materials: engineering methods for deformation,fracture, and fatigue, Fourth Edition, 2013, Pearson"
            }
        },
        {
            "code": "MS2014",
            "title": "Materials Structure and Defects",
            "coreq": [
                "MS1018"
            ],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms2014_materials_structure_defects.pdf",
            "aus": 3,
            "type": "Core",
            "instructor": [
                "Chen Zhong",
                "Wu Dongshuang"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00288",
                "https://dr.ntu.edu.sg/cris/rp/rp02036"
            ],
            "semester": 0,
            "content": {
                "courseAims": "This is one of the core modules for MSE students. It aims to develop your ability to describe materials’ crystal structure and defects, and to understand how they affect materials’ properties and performance. This course prepares MSE students for their future courses on materials properties, processing, and characterization. The principles learnt from this course will be useful for you in designing / selecting materials in your future career.",
                "ilo": "By the end of t he course, the students should be able to:\n1. Describe and understand various types of lattice structures (Bravais lattices).\n2. Express crystallographic directions and planes and calculate their properties (vector length, unit cell volume, d -spacing, linear density, planar density, atomic / ionic packing factor etc.) and geometric relationship with the aid of formula.\n3. Describe and explain representative metal and ceramic structures.\n4. Define different types of defects in metals and ceramics.\n5. Determine how crystal line defects would affect material properties based on basic principles and propose possible solutions.",
                "courseContent": "1. Crystallography\n2. Metal structures\n3. Ceramic structures\n4. Crystalline defects",
                "courseReference":"Main references:\nSamuel M. Allen and Edwin L. Thomas, The Structure of Materials, John Wiley, 1999\nAnthony Kelly and Kevin M. Knowles, Crytallography and Crystal Defects, 2nd Edition,John Wiley, 2012\n\nSpecial topics:\nChristopher Hammond, Introduction to Crystallography, Revised Edition, Oxford University Press, 1992\nDerek Hull and D. J. Bacon, Introduction to Dislocations, 5th Edition, Pergamon Press,2011"
            }
        },
        {
            "code": "MS2084",
            "title": "Phase Transformations and Kinetics in Steels",
            "coreq": [],
            "prereq": [
                "MS2016",
                "MS1017",
                "MS1018"
            ],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms2084_phase_transformations_and_kinetics_in_steels.pdf?sfvrsn=f1caf3ac_3",
            "aus": 1,
            "type": "Core",
            "instructor": [
                "Aravind Babu Dasari"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp01054"
            ],
            "semester": 2,
            "content": {
                "courseAims": "The fundamental understanding of phase transformations in materials is the key for tuning their structure and properties. This course will provide the necessary basic knowledge to relate bonding, diffusion, and temperature (heat treatment) in solids, particularly steel , to their evolution of structure/phase and properties . That is, it presents the connections between thermodynamic concepts, phase transformations and materials properties.  More specifically,  the students will have the opportunity to experience the fundamental concepts lectured in class through experimental work and analyzing/reflecting on the obtained data, and ultimately connecting with the concepts.\n\nThe students after listening to the content will work in the lab in groups on different carbon steel samples. They are expected to polish, etch, and understand the grain and microstructure along with their impact and hardness properties before subjecting to different heat treatment conditions. The students will be austenizing the samples and cool them using different cooling rates to achieve desired effect on properties.",
                "ilo": "By the end of this course, you (as a student) would be able to:\n1. Identify carbon sites (interstitial positions – octahedral and tetrahedral) in both ferrite and austenite iron lattices; and illustrate the ir importance in terms of strength and hardness of the system.\n2. Demonstrate the use of Time -Temperature Transformation (TTT) diagrams.\n3. Describe the effects of changing process parameters on the microstructure of steels.\n4. Explain the mechanisms of phase transformations in steels (based on diffusion and diffusionless transformations).\n5. Describe martensitic and pearlitic transformations.\n6. Explain the importance and types of cast iron, effects of cooling rate on the microstructure of cast iron, and significance of carbon equivalent.",
                "courseContent": "1 Introduction to pha se transformations and kinetics\n2 TTT charts  and the different types of transformations\n3 Diffusionless transformations\n4 Diffusion -based transformation\n5 Cast iron\n6 Laboratory – group project\n7 Tutorials on the concepts discussed","courseReference":"Suggested reading:\n-Phase Transformations in Metals and Alloys, 3rd edition, David A Porter, Kenneth E,Easterling, Mohamed Sherif, 2009, CRC Press, ISBN: 978-1-42006-210-6\n-Theory of Transformations in Steels, 1st edition, H.K.D.H. Bhadeshia, 2021, CRC Press,ISBN: 978-1-00305-678-2\n-Phase Transformations in Steels, Editors: Elena Pereloma and David V. Edmonds, Vol. 2,Woodhead Publishing Series in Metals and Surface Engineering, 2012, ISBN: 978-1-84569-970-3\n-Fundamentals of solidification, 4th edition, W. Kurz and D.J. Fisher, 1998, Trans Tech Publications, ISBN: 978-0-87849-804-8\n\nAdditional reading:\n-Materials science and engineering: an introduction, Willian D Callister, Wiley\n-Introduction to the thermodynamics of materials, 5th edition by David Gaskell, Yaylor and Francis, 2008"
            }
        },
        {
            "code": "ML0004",
            "title": "Career and Entrepreneurial Development for the Future World",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/default-source/default-document-library/inspire/ml0004-outline-ay2021-s2.pdf",
            "aus": 2,
            "type": "Soft Skills",
            "instructor": [],
            "instructor_link": [],
            "semester": 0,
            "content": {
                "courseAims": "In today’s competitive and rapidly evolving world, students must equip themselves with critical career skills  and a deep  sense of workplace values and ethics, and possess an innovative and enterprising ethos  whether they are joining an established enterprise or starting a new enterprise.\n\nThis course is a compulsory foundation module for all NTU students on essential career preparation and innovative enterprising skills and should be complete d by students before they start their internship. This course equips  students  with practical skills needed in their career preparation and development (including skills required for internship stints and graduation job search) to help students succeed in a new disruptive workplace. Students will learn the fundamental techniques  and concepts  of Business Model  Innovation  and apply them in teams to find innovative and viable solutions to real-life problem s posed  by partnering  enterprises. In the process of working in teams, students will further hone their  teamwork skills.",
                "ilo": "By the end of the course, students  should be able to:\n1. Describe the implications and impact of Future of Work on their  personal and professional development\n2. Demonstrate the professional skills required and the importance of entrepreneurship in 21st-century economics\n3. Explain the innovative enterprising  mindset\n4. Identify career values, occupational interests, personality and motivated skills (VIPS) and learn the 4-stage career development plan in deciding their career paths (‘SODA’)\n5. Demonstrate the fundamental skills to kickstart their  Career Development\n6. Describe the competitive advantages and entrepreneurial ecosystem for startups  in Singapore\n7. Develop the fundamental skills to identify and develop an innovative and enterprising idea/solution into a plan of action\n8. Identify networking dos and don’ts to navigate networking opportunities\n9. Prepare a short presentation on an innovative an d enterprising idea/solution to address an opportunity or problem\n10. Identify ethical and workplace-related issues\n11. Develop problem -solving  skills through collaborative learning via group project s with students from different Schools/Colleges to complete a common goal",
                "courseContent": "Topics covered:\n1. Future of Work & Developing an Innovative and  Enterprising Mindset\n2. Charting a Career Path\n3. Fundamental Skills to Start a New Enterprise\n4. Fundamental Skills for Career Devel opment\n5. Building Networking Skills for Career & Ent erprise\n6. Handling Ethical & Workplace Issues Professionally",
                "courseReference":""
            }
        },
        {
            "code": "CC0006",
            "title": "Sustainability: Society, Economy & Environment",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/default-source/default-document-library/inspire/cc0006-outline-ay2021-s2.pdf",
            "aus": 3,
            "type": "Soft Skills",
            "instructor": [],
            "instructor_link": [],
            "semester": 0,
            "content": {
                "courseAims": "This course aims to provide multi-disciplinary competence in a cross-disciplinary, collaborative learning environment, with student interaction and collaboration across schools as a key component .\n\nIn this course, you will systematically analyse major current sustainability challenges from the perspectives of society, economy, and the environment, with specific focus on Singapore. The course aims to stimulate critical thinking, curiosity, and the ability to structure and synthesise knowledge through the lens of sustainability. Emphasis is on the need to address sustainability issues from different perspectives and at different scales, reinforced by concrete examples such as palm oil production, waste management, pollution & human consumption, and climate change. The course will look at how we can promote a more sustainable world through choices and actions, as individuals, societies, nations, and as a global community.\n\nBy the end of the course, you would have developed an awareness for, and a systems thinking approach to, sustainability, which you can continue to develop no matter which discipline or career path you choose to embark on.",
                "ilo": "Upon the successful completion of this course, you (as a student) will be able to:\n1. Explain the multidimensional systemic nature of sustainability.\n2. Analy se sustainability challenges from social, economic, and environmental perspectives.\n3. Identify and present possible solutions for a sustainable world on different scales for the individual, organisations, Singapore, and globally.\n4. Critically discuss sustainabil ity issues in small and large group settings .\n5. Collaborate effectively on sustainability issues in cross -disciplinary teams.\n6. Evaluate the work of peers on sustainability.",
                "courseContent": "Topics to be covered in the course:\n1. Why each discipline should know about sustainability.\n2. The three systems: Society, Economy, and Environment. How sustainable development depends on all three systems, and how to analy se the course topics from these three perspectives.\n3. Energy and Climate Change, sustainable and reliable sour ces, mitigation of climate change.\n4. Food system sustainability and global food security. *\n5. Responsible consumption and production - waste reduction.\n6. Water – availability and sustainable management of water resources. *\n7. Pollution – air, plastics, light, noise .*\n8. How unequal is the world? Poverty and equality - how to measure it, how widespread it is, how to eradicate it\n9. Sustainable cities. Role of big cities in sustainability development.  What is a sustainable city? *\n10. Planetary boun daries, Earth system feedbacks and tipping points – staying in control of our planet and its systems.\n* Topics that will have strong focus on Singapore",
                "courseReference": ""
            }
        },
        {
            "code": "MS3014",
            "title": "Analysis of Materials",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms3014_analysis_of_materials.pdf",
            "aus": 3,
            "type": "Core",
            "instructor": [
                "Fong Wen Mei, Eileen",
                "Annalisa Bruno"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00768",
                "https://dr.ntu.edu.sg/cris/rp/rp02344"
            ],
            "semester": 0,
            "content": {
                "courseAims": "Designed for third year undergraduate students with little background in material characterization, this course aims to introduce various materials characterization techniques, involving both fundamental theoretical frameworks and operati ons in a virtual lab. The fundamental theoretical frameworks provide detailed and comprehensive working principles of various equipment for imaging, spectroscopy and diffraction methods used in the compositional and structural characterization of engineeri ng materials.  The virtual lab in this course offers vivid instruction in the most widely practiced equipment for materials evaluation such as x-ray diffraction (XRD). Due to the limited access of undergraduate students to the above popular equipment, the virtual lab allows students to operate such equipment and explore various functions anytime outside the classroom, arousing interest by hands-on operation and enhancing understanding of the theoretical knowledge.  The goal is to provide you with a foundation in the use of characterization techniques to diagnose and solve material problems that can be identified and potentially resolved in their forthcoming final year project and future research experience.",
                "ilo": "By the end of this course, you should be able to:\n1. Describe working principles of electron microscopy and the theory of image formation.\n2. Explain basic principles of UV-Vis, fluorescence and vibration spectroscopy, and to derive material properties from the data acquired.\n3. Describe the working principles of x-ray diffraction, x-ray fluorescence spectroscopy and x-ray photoelectron spectroscopy, and to derive material properties from the data acquired.\n4. Identify suitable applications for each of the techniques covered, and provide justifications for the choice.",
                "courseContent": "1. Imaging Methods\n2. Energy Dispersive X-ray Analysis\n3. UV-Vis Spectroscopy\n4. Vibrational Spectroscopy\n5. Fluorescence Spectroscopy",
                "courseReference": "-A.R West, Solid State Chemistry and its Applications, (2nd ed), John Wiley & Sons Ltd,2022\n -Cullity, B.D., Stock, S.R. Elements of X-ray diffraction (3rd ed), Pearson New International Edition, 2014\n -Goldstein, J. Scanning Electron Microscopy and X-Ray Microanalysis (4th ed), Springer,2018"
            }
        },
        {
            "code": "MS3015",
            "title": "Industrial Design",
            "coreq": [
                "MS3011",
                "MS3082"
            ],
            "prereq": [
                "MS1017",
                "MS1018",
                "MS2013",
                "MS2083"
            ],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms3015_industrial_design.pdf",
            "aus": 3,
            "type": "Core",
            "instructor": [
                "Fong Wen Mei, Eileen"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00768"
            ],
            "semester": 0,
            "content": {
                "courseAims": "This course aims to create an innovative environment that allows students to apply and integrate their theoretical knowledge and skills to solve open-ended real life problems. Students will have the opportunity to work in teams, and to learn how to apply design processes to design and create prototypes for their solutions. Students will be required to produce a short video on their project. Their work will also assessed orally by a panel of judges.",
                "ilo": "By the end of this course, you (as a student) would be able to:\n1. Design a systematic plan based on sound design thinking processes to solve an identified problem;\n2. Work together as a team;\n3. Identify and apply engineering tools to solve identified problem;\n4. Present and market your work to an audience and a panel of judges.",
                "courseContent": "Students will be taught design processes in order to design a systematic approach to solve problems identified in their projects. The technical content of the project will vary according to the type of the projects provided by industrial partners, mostly related to materials science and/or engineering. Students will also likely be exposed to electronics, 3D printing, fabrication and materials testing in their prototyping process.",
                "courseReference":"As content is project dependent, students are expected to seek their own references that are relevant to their projects."
            }
        },
        {
            "code": "MS3011",
            "title": "Metallic and Ceramic Materials",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms3011_metallic_ceramic_materials.pdf",
            "aus": 3,
            "type": "Core",
            "instructor": [
                "Raju V. Ramanujan",
                "Xiaolei Feng"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00892",
                "https://dr.ntu.edu.sg/cris/rp/rp02119"
            ],
            "semester": 0,
            "content": {
                "courseAims": "This course deals with two important classes of engineering materials, i.e., metals and ceramics. You will study the structure, properties and applications of metals and alloys. The structure of ceramics will studied and correlated with their properties and process.",
                "ilo": "On completion of the course, you shall be able to:\n1. Describe Engineering applications of metals and alloys\n2. Explain strengthening  mechanisms in metals and alloys\n3. Identify and describe microstructure and heat t reatment of ferrous and selected non -ferrous alloys\n4. Define and explain Atomic -,nano -, micro -structure, properties of typical ceramics.\n5. List, discuss,  apply and assess properties of ceramics materials\n6. List, discuss, apply and assess process of ceramics materials\n7. Analyse microstructure -property -structure relationship of ceramic.",
                "courseContent": "Introduction and classification of engineering metals and alloys. Strengthening mechanisms. Microstructure and heat treatment of ferrous alloys. Mechanical properties of ferrous alloys. Non Ferrous alloys. Structures of ceramics, Properties of ceramics. Processing of ceramics. Property enhancement of ceramics, property-structure relationship of ceramic.",
                "courseReference":"Suggested reading:\n\n1. W,D, Callister, Materials Science and Engineering: An Introduction, Wiley, 2014\n2. D. Henkel and A. Pense, Structure and Properties of Engineering Materials, 5th Edition,McGraw Hill, 2001.\n3. R.E. Smallman, R. Bishop, Physical Metallurgy and Advanced Materials, 7th Edition, Butterworth-Heinemann, 2007.\n4. M. Barsoum, Fundamentals of Ceramics, IOP publishing Ltd, 2003."
            }
        },
        {
            "code": "MS3013",
            "title": "Electrochemical Corrosion",
            "coreq": [
                "MS2013",
                "MS3011"
            ],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms3013_electrochemical_corrosion.pdf?sfvrsn=64c0771f_3",
            "aus": 3,
            "type": "Core",
            "instructor": [
                "Huang Yizhong",
                "Wu Dongshuang"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00979",
                "https://dr.ntu.edu.sg/cris/rp/rp02036"
            ],
            "semester": 0,
            "content": {
                "courseAims": "Theory component:\n1. Learn how the environmental affects the properties and performance of engineered metallic and ceramic materials.\n2. Understand the prevention of the negative environmental effects on metallic and ceramic using electrochemical methods.\n3. Master some of the basic principles of corrosion and degradation of metals and alloys.\n\nLaboratory component:\n4. Understand the principles of electrochemistry and experimental-related set-ups.\n5. Use the electrochemical approaches to probe the thermodynamic and kinetic aspects of corrosion, including the rate of corrosion.\n6. Master certain software and mathematics in dealing with the experimental data.\n7. Link the theoretical knowledge with experimental phenomena.\n\nThis would be useful for those of you who are interested corrosion engineering of materials applied in material industry.",
                "ilo": "By the end of this course, student will be able to:\nTheory component:\n1. Identify how the environment affects the degradation or corrosion of metallic and ceramic materials.\n2. Determine the prevention or stabilization methods for metallic and ceramic materials degradation due to environmental effects.\n3. Determine how metallic and ceramic materials can be used and their reliability in di fferent conditions.\n\nLaboratory component:\n4. Get hands-on knowledge on how the environment affects the degradation or corrosion of metallic and ceramic materials.\n5. Determine whether electrochemical techniques are of use for a given problem related corrosion.\n6. Correlate theoretical concepts to practical phenomena.\n7. Draw logical conclusions from experimental data.\n8. Produce reports in accordance with established practices of the engineering discipline.",
                "courseContent": "Theory component:\n1. Electrochemical corrosion mechanism of metallic materials: Corrosion cells; The electrochemical series; Polarization; Evan's diagrams (Tafel plot); Mixed potential theory; Pourbaix diagrams and Passivation\n2. Forms of corrosion of metallic materials: Uniform corrosion; Localized corrosion including pitting, crevice corrosion, selective dissolution, intergranular corrosion, environment -sensitive cracking, flow -assisted corrosion, microbiologically influenced corrosion (MIC).\n3. Principles of corrosion protection of metallic materials: Materials selection; Design against corrosion; Corrosion inhibitors; Protective coatings; Cathodic protection and anodic protection.\n4. Failure of ceramic materials in gaseous and liquid environments\n5. High temperature oxidation, oxidation in complex environment and oxidation remedy of non -oxide ceramics\n6. Briefing: principle of electrochemistry\n7. Lab Course: an introduction to electrochemistry and the general set-ups (EP1)\n8. Lab Course: polarization curve analysis (EP2)\n9. Lab Course: electrochemical impedance spectroscopy (EP3)\n10. Lab Course: current distribution and mass transfer (EP4)\n11. Lab-Course: For anyone who cannot attend EP2 -4 in time or failed in any of the above experiments\n12. Tutorial or Special lecture from the experts in Electrochemistry related field",
                "courseReference":"Theory component\nSuggested reading:\n1. Electrochemistry by Carl Hamann, et. al., 2ed ed. Wiley-VCH press, 2007.\n2. Corrosion for Science and Engineering by K. R. Trethewey and J. Chamberlain, 2nd ed., Longman, 1995\n3. Fundamentals of Polymer Degradation and Stabilisation, edited by Norman S. Allen and Michelle Edge, Elsevier Science Publishers, England,1992.\nRecommended references:\n4. Principles and Prevention of Corrosion by Denny Jones, 2nd ed., Prentice-Hall\n5. Corrosion Engineering by Mars G. Fontana, 3rd ed.\n6. NACE Corrosion Engineer’s Reference Book by R. Baboian, 3rd ed, NACE Press\n7. Weathering of Polymers, by Anthony Davis and David Sims, Elsevier Applied Science Publishers Ltd, England, 1983\n8. Handbook of Polymer Degradation, edited by S. Halim Hamid, Mohamad B. Amin and Ali G Maadhah, Marcel Dekker, Inc. , 1992\n9. Compositional and Failure Analysis of Polymer, by John Scheirs, John Wiley & Sons, 2000\n\nLaboratory component\nPrescribed texts:\nescribed texts:\n1. Electrochemistry by Carl Hamann, et. al., 2ed ed. Wiley-VCH press, 2007.\n2. Corrosion for Science and Engineering by K. R. Trethewey and J. Chamberlain, 2nd ed., Longman, 1995\n3. Fundamentals of Polymer Degradation and Stabilisation, edited by Norman S. Allen and Michelle Edge, Elsevier Science Publishers, England,1992.\nRecommended references:\n1. Principles and Prevention of Corrosion by Denny Jones, 2nd ed., Prentice-Hall\n2. Corrosion Engineering by Mars G. Fontana, 3rd ed.\n3. NACE Corrosion Engineer’s Reference Book by R. Baboian, 3rd ed, NACE Press\n4. Weathering of Polymers, by Anthony Davis and David Sims, Elsevier Applied Science Publishers Ltd, England, 1983\n5. Handbook of Polymer Degradation, edited by S. Halim Hamid, Mohamad B. Amin and Ali G Maadhah, Marcel Dekker, Inc. , 1992\n6. Compositional and Failure Analysis of Polymer, by John Scheirs, John Wiley & Sons, 2000"
            }
        },
        {
            "code": "MS3012",
            "title": "Micro/ Nanoelectronic Materials Processing",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms3012_micro_nanoelectronic_materials_processing.pdf",
            "aus": 3,
            "type": "Core",
            "instructor": [
                "Lydia Helena Wong",
                "Nripan Mathews"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00968",
                "https://dr.ntu.edu.sg/cris/rp/rp00211"
            ],
            "semester": 0,
            "content": {
                "courseAims": "This course is an introduction to advanced materials processing, with focus on micro/nano-electronics. It is essential for those of you who desire to specialize in microelectronics device fabrication. It also serves as a pre-requisite for the more advanced  microelectronics elective modules offered in their fourth year.\n\nThis subject includes an introduction to fundamental semiconductor operation and device physics. The course covers the basics of semiconductor technology, from bare silicon to finished prod ucts. The process steps include bulk crystal growth, oxidation, diffusion, ion implantation, thin film deposition, lithography and etching. Factors that affect the materials’ properties from the process steps will be highlighted. New materials that are inc orporated into the state-of-the-art semiconductor processes are also discussed. Advanced techniques in lithography and film deposition are introduced, as well as advanced novel devices.",
                "ilo": "By the end of the course, you sho uld be able to:\n1. Calculate carrier resistivity, conductivity and carrier concentration of a doped semiconductor.\n2. Explain how doping concentration affects resistivity, conductivity, carrier mobility in Silicon.\n3. Explain the purpose of typical silicon wafer manufacturing processes, including thermal oxidation, diffusion, ion implantation, physical/chemical vapor deposition, photolithography and etching processes.\n4. Determine specific process parameters such as: thermal oxide thickness, junction depth, surface concentration, thin film thickness etc.\n5. Determine the mask thickness to block implantation ions.\n6. Evaluate and determine the best process to deposit oxide of various thickness and dimensions.\n7. Evaluate and determine the best process for doping Silicon at the source drain, n-well, p-well, etc.\n8. Calculate the parameters associated with etching based on etch selectivi ty, rates and anisotropy\n9. Correlate how the parameters of the deposition process (eg. Pressure, temperature, ion energy) affects film uniformity and quality both from a qualitative and quantitative point of view\n10. Choose the type of photolithography process flows based on the context provided.\n11. Evaluate the various deposition techniques to choose the appropriate processes based on the material deposited as well as the desired quality\n12. Explain the dependencies that affect resolution and related parameters in opti cal lithography systems",
                "courseContent": "Microelectronics Technology Overview. Overview of semiconductor Device Physics. Diffusion and Thermal Oxidation. Ion Implantation. Chemical and Physical Thin Film Deposition. Patterning, Lithography.",
                "courseReference":"Textbooks\n1. J. D. Plummer, M. D. Deal and P. B. Griffin, Silicon VLSI Technology, 2000, Prentice Hall.\n2. S. M. Sze, Semiconductor Devices (Physics and Technology), John Wiley & Sons,2002,2nd edition\n\nReferences\n1. S. Campbell, The Science & Engineering of Microelectronic Fabrication, 1996, Oxford\n2. S. M. Sze, VLSI Technology, VLSI Technology, 1988, McGraw Hill.\n3. Y. Chang and S. M. Sze, ULSI Technology, 1996, McGraw Hill.\n4. S. K. Ghandhi, VLSI Fabrication Principles, 1994, John Wiley.\n5. H. H. Lee, Fundamentals of Microelectronics Processing, 1990, McGraw Hill."
            }
        },
        {
            "code": "HW0288",
            "title": "Effective Communication",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/hw0288_engineering_communication.pdf",
            "aus": 2,
            "type": "Foundational Core",
            "instructor": [],
            "instructor_link": [],
            "semester": 0,
            "content": {
                "courseAims": "This course will improve the writing skills of students with particular reference to the Final Year Project (FYP) report, and their communication skills in professional settings.",
                "ilo": "Upon successful completion of this course, the students should be able to:\n(i) Apply various principles of technical writing to produce an effective FYP report\n(ii) Understand the communication demands of the contemporary workplace, and\n(iii) Make effective technical presentations, with reference to their FYPs and the workplace.",
                "courseContent": "This course  focuses on important co ncepts in engineering communication and advanced professional communication skills, with reference to:\n(i) Technical communication and the Final Year Project, and\n(ii) Communication in the contemporary workplace.",
                "courseReference":""
            }
        },
        {
            "code": "MS3099",
            "title": "Professional Internship",
            "coreq": [
                "MS1016",
                "MS2018"
            ],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms3099.pdf?sfvrsn=397fded5_16",
            "aus": 10,
            "type": "Foundational Core",
            "instructor": [],
            "instructor_link": [],
            "semester": 999,
            "content": {
                "courseAims": "This 20-week internship programme is offered as a core course for all Materials Science and Engineering undergraduate students.\n\nThe purpose of this programme is to enable the application of knowledge and skills you have learned in the university in an authentic work environment. This is such that you can gain relevant exposures and develop practical industry experiences and skills that will facilitate your career decision and future transition into your selected vocation. It aims for you to develop profes sional competencies that will enhance your employability and lifelong learning capabilities to support your career and life endeavours and your readiness for the future of work.",
                "ilo": "At the end of the internship programme, you (as a student) should be able to:\n\nI. Cognitive\n1. Apply knowledge and skills relevantly and appropriately in the workplace.\n2. Identify your own competency gaps at the internship workplace.\n3. Evaluate and develop personal learning and development pathways towards bridging competency gaps identified in point (2) above.\n4. Develop and apply strategies to solve problems effectively (involves critical thinking and creativity, generating questions, resourcing, application, and reiteration).\n5. Evaluate resou rces and develop insights to make informed judgements and recommendations.\n\nII. Context\n1. Discuss the internship organisation’s nature and context of business.\n2. Reflect on the organisational culture at the internship organisation.\n3. Appraise the significance and im pact of the project/work/assignment undertaken at the internship organisation.\n4. Describe the career pathways within the internship organisation as well as the broader industry.\n5. Reflect on personal and professional development needs within the internship org anisation as well as the broader industry and set strategic goals for advancing along an intended career path.\n6. Apply time and task management strategies effectively.\n\nIII. Relationship\n1. Apply effective written and oral communication skills in professional settings when communicating and connecting with relevant stakeholders.\n2. Assimilate into the work environment (people, team, hierarchy) and function effectively.\n\nIV. Affective/Moral\n1. Tolerate ambiguity and handle anxiety.\n2. Contribute proactively to the internship organisation.\n3. Demonstrate responsibility, integrity and professionalism in the fulfilment of all workplace and internship requirements.\n4. Demonstrate the persiste nce to learn, overcome and improve.\n\nV. Technical (including those related specifically to the degree programme learning outcomes)\nUse tools that enable and facilitate effective project/work/assignment undertaken at the internship organisation.",
                "courseContent": "This internship programme, being a work -integrated education course, has its educational content embedded within the work environment and assignments that students will undertake at each internship organisation. For this reason, the internship job  scope will be evaluated by the course instructor/coordinator(s) using the following criteria:\n1. It is relevant to the student’s discipline of study;\n2. It provides the required internship duration;\n3. It accommodates NTU’s internship periods;\n4. It provides sufficie nt structure and rigour that will enable students to achieve the intended learning outcomes listed above;\n5. It provides the appropriate workload for the stipulated internship period;\n6. It enhances the career prospects of the student;\n7. The internship workplace i s safe and conducive for student learning and development;\n8. The internship workplace is equipped with the necessary tools and resources for the internship work;\n9. The internship organisation has standing policies to safeguard the welfare of interns;\n10. The internship organisation supervisor possesses the competencies, experience, and commitment to provide guidance to the students;\n11. The internship organisation will use NTU’s internship assessment scheme for students.",
                "courseReference":"As content is project-dependent, students are expected to seek references that are relevant to the projects"
            }
        },
        {
            "code": "MS3096",
            "title": "Professional Internship",
            "coreq": [
                "MS1016",
                "MS2018"
            ],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms3099.pdf",
            "aus": 10,
            "type": "Foundational Core",
            "instructor": [],
            "instructor_link": [],
            "semester": 999,
            "content": {
                "courseAims": "This 20 -week internship programme is offered as a core course for all Materials Science and Engineering undergraduate students.\n\nThe purpose of this programme is to enable the application of knowledge and skills you have learned in the university in an authentic work environment. This is such that you can gain relevant exposures and develop practical industry experiences and skills that will facilitate your career decision and future transition into your selected vocation. It aims for you to develop profes sional competencies that will enhance your employability and lifelong learning capabilities to support your career and life endeavours and your readiness for the future of work.",
                "ilo": "At the end of the internship programme, you (as a student) should be able to:\n\nI. Cognitive\n1. Apply knowledge and skills relevantly and appropriately in the workplace.\n2. Identify your own competency gaps at the internship workplace.\n3. Evaluate and develop personal learning and development pathways towards bridging competency gaps identified in point (2) above.\n4. Develop and apply strategies to solve problems effectively (involves critical thinking and creativity, generating questions, resourcing, application, and reiteration).\n5. Evaluate resou rces and develop insights to make informed judgements and recommendations.\n\nII. Context\n1. Discuss the internship organisation’s nature and context of business.\n2. Reflect on the organisational culture at the internship organisation.\n3. Appraise the significance and im pact of the project/work/assignment undertaken at the internship organisation.\n4. Describe the career pathways within the internship organisation as well as the broader industry.\n5. Reflect on personal and professional development needs within the internship org anisation as well as the broader industry and set strategic goals for advancing along an intended career path.\n6. Apply time and task management strategies effectively.\n\nIII. Relationship\n1. Apply effective written and oral communication skills in professional settings when communicating and connecting with relevant stakeholders.\n2. Assimilate into the work environment (people, team, hierarchy) and function effectively.\n\nIV. Affective/Moral\n1. Tolerate ambiguity and handle anxiety.\n2. Contribute proactively to the internship organisation.\n3. Demonstrate responsibility, integrity and professionalism in the fulfilment of all workplace and internship requirements.\n4. Demonstrate the persiste nce to learn, overcome and improve.\nV. Technical (including those related specifically to the degree programme learning outcomes)\nUse tools that enable and facilitate effective project/work/assignment undertaken at the\ninternship organisation.",
                "courseContent": "This internship programme, being a work -integrated education course, has its educational content embedded within the work environment and assignments that students will undertake at each internship organisation. For this reason, the internship job  scope will be evaluated by the course instructor/coordinator(s) using the following criteria:\n1. It is relevant to the student’s discipline of study;\n2. It provides the required internship duration;\n3. It accommodates NTU’s internship periods;\n4. It provides sufficie nt structure and rigour that will enable students to achieve the intended learning outcomes listed above;\n5. It provides the appropriate workload for the stipulated internship period;\n6. It enhances the career prospects of the student;\n7. The internship workplace i s safe and conducive for student learning and development;\n8. The internship workplace is equipped with the necessary tools and resources for the internship work;\n9. The internship organisation has standing policies to safeguard the welfare of interns;\n10. The internship organisation supervisor possesses the competencies, experience, and commitment to provide guidance to the students;\n11. The internship organisation will use NTU’s internship assessment scheme for students.",
                "courseReference":"NTU Student Internship Handbook\nPlease refer to the respective Professional Internship/Attachment Teamsites via NTU Studentlink for the Internship Handbook.\nNTU Work-Integrated Education Blog - WIE ARISE\nhttps://blogs.ntu.edu.sg/wie-arise/\nHarvard Business Review: 6 Ways to Make the Most of Your Internship\nhttp://bit.ly/2J81BU2\nHuffington Post: 21 Ways to Make the Most of Your Internship\nhttp://bit.ly/2kK6Fz5\nVault: How to Successfully Manage your Assignments:\nhttp://bit.ly/2LNfrIX"
            }
        },
        {
            "code": "MS4089",
            "title": "Final Year Project",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4089_final_year_project.pdf",
            "aus": 8,
            "type": "Core",
            "instructor": [],
            "instructor_link": [],
            "semester": 999,
            "content": {
                "courseAims": "The main objective of the Final Year Project is to provide a platform for you to demonstrate your  ability to apply your  knowledge and skills gained from coursework studies and practicum work. This course helps you to gain confidence and experience  in tackling project work independently which should contribute to your  effective transition to the job market upon graduation.",
                "ilo": "By the end of this course, you (as a student) would be able to:\n1. Undertake projects independently so that under similar professional requirement as engineers, he/s he will be able to perform literature review, involving research and critical evaluation skills, acquire technical knowledge of the subject matter independently and complete projects successfully.\n2. Make sound decisions, to progress and develop time and resource ma nagement skills to complete the project successfully.\n3. Write good quality technical reports so that readers can understand the significance of the problems addressed and the application of engineering knowledge in reaching the solutions presented w ithin th e reports.\n4. Deliver presentations that are required as engineers.",
                "courseContent": "Projects may include, but are not limited to, one or more of the following areas: Design, Product development, Software development, Laboratory investigation, Computing and analysis, Field testing and instrumentation and Feasibility studies. Besides project proposals generated by its own academic staff, the School also works with outside partners including the A*STAR Research Institutes and industrial companies to  propose relevant projects.",
                "courseReference":"As content is project-dependent, students are expected to seek references that are relevant to the projects."
            }
        },
        {
            "code": "MS4013",
            "title": "Biomaterials",
            "coreq": [
                "MS2013",
                "MS3011"
            ],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4013_biomaterials.pdf",
            "aus": 3,
            "type": "Core",
            "instructor": [
                "Czarny Bertrand"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp01037"
            ],
            "semester": 0,
            "content": {
                "courseAims": "This course will introduce you to the types of biomaterials used in health care applications. In particular, host reactions to biomaterials and biological testing of metallic, ceramic and polymeric biomaterials will be discussed. In vitro and in vivo biocompatibility of materials will be discussed in relation to the actual applications. Some key applications (case studies) of each  type of biomaterial will be covered, along with a discussion of the failure of biomedical devices caused by biocompatibility problems.",
                "ilo": "By the end of this course, you (as a student) would be able to:\n1. Predict the role of biomaterials in medicine\n2. Define biomaterials & biocompatibility\n3. Explain the different role of biomaterials – Temporary, Degradable, Permanent\n4. Describe and identify application of the different classes of Biomaterials – Metals, Ceramics, Polymers, hydrogels\n5. Explain the implant Failure – Infection, Loosening, Fracture & Wear\n6. Describe the effect of implant on body – toxic, bioinert, bioactive\n7. Explain the effect of body on implant – environmental effect: corrosion, degradation\n8. Explain the history of Biomaterials – Why some implants work, why some don’t, evolution of role of biomaterials – from passive (bioinert) to interactive & integrative bioactive) to instructive (regenerative medicine)",
                "courseContent": "Introduction to Biomaterials; Biology and Medicine; Biocompatibility; Biological Testing of Materials; Classes of Materials used in Medicine; Applications",
                "courseReference":"Suggested reading:\n-Biomaterials Science, An introduction to materials in medicine, 2nd edition, Buddy Ratner,Allan Hoffman, Frederick Schoen, Jack Lemons,2004\n-Biomaterials, An introduction, 3rd edition, Joon Park, R. S. Lakes, Springer, 2007.\n-Biomaterials, A basic introduction, 1st edition, Qizhi Chen, George Thouas, CRC Press, 2018\n\nAdditional reading:\n-Materials science and engineering: an introduction, Willian D Callister, Wiley\nM.F. Ashby and D.R.H. Jones, Engineering Materials (vol 1), Published by Butterworth Heinemann"
            }
        },
        {
            "code": "MS4012",
            "title": "Quality Control",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4012_quality_control.pdf",
            "aus": 3,
            "type": "Core",
            "instructor": [
                "Li Shuzhou"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00773"
            ],
            "semester": 0,
            "content": {
                "courseAims": "This course is about the modern use of quality management and statistical methods for quality control and improvement. The main objectives are two -fold, firstly, s to introduce statistical theory and methods used in quality control and quality assurance. Secondly, is to bring forth the importance of quality management as an essential part of manufacturing and business competitive strategy.",
                "ilo": "By the end of this course, you (as a student) would be able to:\n1. Explain the concepts of probability and basic statistics\n2. Identify the commonly used distributions and use them to calculate probabilities\n3. Make statistical estimation of confidence limits and intervals\n4. Perform suitable hypothesis testing in a practical scenario\n5. Describe the dynamic of quality management in modern manufacturing and business environment\n6. Apply quality control techniques creatively to meet both manufacturing and business needs\n7. Consciously apply the divergent thinking, convergent thinking and decision-making steps in quality analysis.\n8. Work with specialists of their own discipline and other disciplines as well as leading project teams on quality related matters.\n9. Arrive at practical solutions to quality problems through proper quality analysis.",
                "courseContent": "Concepts of probability and basic statistics (mean, median, variance, percentile, outlier) and discrete (Bernoulli, Binomial, Poisson, Hypergeometric) & continuous (Exponential, Normal, Student’s) probability distributions. Statistical estimation of confidence limits and intervals. Tests of hypothesis. Type - I and II errors. Statistical process control, Basic quality concepts, quality management, quality costs and productivity improvement, and acceptance sampling.",
                "courseReference":"Suggested reading:\n-Statistics for Engineers and Scientists, William Navidi, 3rd edition, McGraw-Hill International Edition\n -Statistical Quality Control, Douglas Montgomery, 7th edition, John Wiley & Sons, International Student Version\n\nAdditional reading:\n-Probability and Statistics for Engineers and Scientists, Ronald E. Walpole, Raymond H. Myers,Sharon L. Myers, Keying Ye,9th Edition, Pearson"
            }
        },
        {
            "code": "MS4014",
            "title": "Nanomaterials: Fundamentals and Applications",
            "coreq": [],
            "prereq": [
                "MS2018",
                "MS3012",
                "MS3013"
            ],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4014_nanomaterials_fundamentals_and_applications.pdf",
            "aus": 3,
            "type": "Core",
            "instructor": [
                "Yan Qingyu",
                "Jason Xu Zhichuan"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00845",
                "https://dr.ntu.edu.sg/cris/rp/rp00561"
            ],
            "semester": 0,
            "content": {
                "courseAims": "This course aims to provide a comprehensive overview of nanomaterials in terms of the synthesis, characterization, properties, and applications. It will cover the fundamental scientific principles for the different synthesis techniques, assembly of nanostructured materials and, new physical and chemical properties at the nanoscale. Existing  and emerging applications will also be discussed through case studies.",
                "ilo": "By the end of this course, you (as a student) would be able to:\n1. Apply the physics of the quantum confinement (by drawing the energy band diagram) to explain the origin of the property difference\n2. Clearly state the difference of the optical and electrical properties between bulk materials and nanomaterials\n3. Extend the concept to explain some daily observed phenomena or device applications\n4. Describe the basic flow of the nanomaterials preparation process by drawing the flow chart of different synthesis approaches\n5. State how the synthesis parameters and kinetic factors would affect the morphology and physical properties of the nanoparticles\n6. Design chemical synthesis routes to make complex nanostructures.\n7. Describe the methods used to address the stability issue of nanoparticles and the underlying principles\n8. Describe the important applications and properties of several typical nanomaterials and expla in the mechanisms.",
                "courseContent": "Introduction to nanomaterials, size effects, properties and applications of nanomaterials, synthesis methods, stabilization and assembly of nanomaterials, characterization of nanomaterials, and existing & emerging applications (case studies).",
                "courseReference":"1. Nanostructures and Nanomaterials -Synthesis, Properties and Applications, Cao Guozhong and Wang Ying, World Scientific Publishing,2nd edition,2011\n2. Nanomaterials: An Introduction to Synthesis, Properties and Applications, Dieter,Vollath, Wiley, 2008\n3. Nanoscale Materials in Chemistry, edited by Kenneth J. Klabunde & Ryan M.Richards, John Wiley & Sons, 2nd edition, 2009."
            }
        },
        {
            "code": "MS4610",
            "title": "Advanced Biomaterials",
            "coreq": [],
            "prereq": [
                "MS3011",
                "MS4013"
            ],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4610_advanced_biomaterials.pdf?sfvrsn=660d065c_8",
            "aus": 3,
            "type": "MPE",
            "instructor": [
                "Luciana Lisa Lao",
                "Loo Say Chye Joachim"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp01244",
                "https://dr.ntu.edu.sg/cris/rp/rp00213"
            ],
            "semester": 1,
            "content": {
                "courseAims": "This prescribed elective course, built on the core MS4013 Biomaterials course, aims to deepen your understanding of the functional performance of biomaterials. The course will equip you with key knowledge on structure and p roperties of several advanced biomaterials (biodegradable polymers, medical ceramics and composites) and their applications in medicine. It also introduces various techniques to modify the surface of biomaterials to improve their biocompatibility with host  tissues. All of this knowledge is essential for students who wish to specialize in medical materials or pursue a career in the biomedical industry.",
                "ilo": "By the end of this course, you (as a student) would be able to:\n1. Explain the chemical and physical degrad ation mechanisms of various synthetic polymers\n2. Classify any given biodegradable polymers into bulk-degrading or surface-eroding groups\n3. Calculate the hydrolysis rate of polymers that degrade by random scission or by chain-end scission\n4. Predict how various polymer-intrinsic factors and external/environmental factors affect the biodegradation rate of polymers\n5. Describe the limitations of conventional drug delivery via oral tablets/capsules\n6. Illustrate the critical roles of polymers in controlled drug delivery\n7. Explain the working principles behind different types of drug delivery systems\n8. Demonstrate that bone matrix is a natural composite biomaterials\n9. Explain bone remodelling process and stress shielding effect on bone caused by implants\n10. Distinguish the host tissues’ responses to three different classes of medical ceramics, namely bioinert, bioactive and biodeg radable ceramics\n11.  Relate the structure and properties of commonly used bioinert, bioactive and biodegradable ceramics to their applications in medicine, particularly as artificial joints, dental implants, bone cements and coatings on orthopaedic implants.\n12. Select an appropriate in-vitro test to measure the index of bioactivity and interfacial bond strength of a given bioactive  ceramic\n13. Use the ternary phase dia gram of bioglass to estimate the index of bioactivity of any bioglasses with varying compositions\n14. Explain the importance of surface modification of biomaterials and its essential role on biocompatibility\n15. Select appropria te techniques to modify the surfac e of various classes of biomaterials without altering their underlying bulk properties",
                "courseContent": "• Biodegradable polymers\n• Advanced medical ceramics\n• Composites bio materials\n• Applications of biomaterials in medicine\n• Surface modification of biomaterials",
                "courseReference":"-Temenoff, Biomaterials: The intersection of biology and materials science, Pearson, 1st Edition\n-L.L.Hench, J. Wilson, An Introduction to Bioceramics, World Scientific, 1993\n-B.D. Ratner, A.S. Hoffman, F.J. Schoen, J.E. Lemons, Biomaterials Science: An Introduction to Materials in Medicine, 3rd Edition, Academic Press, 2013"
            }
        },
        {
            "code": "MS4611",
            "title": "Biomedical devices",
            "coreq": [],
            "prereq": [
                "MS3011",
                "MS4013"
            ],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4611_biomedical_devices.pdf?sfvrsn=72c6c192_12",
            "aus": 3,
            "type": "MPE",
            "instructor": [
                "Dalton Tay Chor Yong"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00189"
            ],
            "semester": 2,
            "content": {
                "courseAims": "The course aims to enable you to:\n1. Demonstrate an understanding on a broad range of biomedical devices (e.g. cardiovascular devices, orthopaedic implants, ophthalmologic devices, and tissue implants)\n2. Appreciate the issues relating to the materials selection, design considerations, sterilization requirements, biocompatibility, and contemporary challenges within the context of biomedical devices development.",
                "ilo": "By the end of this course, you (as a student) would be able to:\n1. Define a nd classify different types of biomedical devices categories\n2. Discuss structural organisation and functions of featured org ans\n3. Explain the working principles and design considerations of featured biomedical devices\n4. Explain  thermodynamics of proteins -materi als interaction and factors influencing this process\n5. Describe the physiological wearing and degradation mechanisms of im plants\n6. Discuss the concept of biocompatibility with reference to host-device interaction and tissue response\n7. Distinguish the different biomedical device sterilization techniques in terms of their working mechanisms and suitability for different classes of biomaterials and/or device\n8. Describe the different types of test methods to evaluate biological performance of biomedical devices\n9. Apply engineering and analytical concepts to critique performance and failures of polymeric, ceramic, and metallic devic es.",
                "courseContent": "Biomedical implants and devices; host-material interaction and tissue responses; biomedical device sterilization; Biosafety evaluation; in vivo performance and failures of biomaterials",
                "courseReference":"Suggested reading:\n-Biomaterials Science: An Introduction to Materials in Medicine, 3rd Edition, edited by B.D.Ratner, A.S. Hoffmann, F.J. Schoen and J.E. Lemons, Academic Press, 2012.\n\n-Additional reading:\nBiological Performance of Materials, 4th Edition, J. Black, CRC Press, 2005.\n-Biocompatibility Assessment of Medical Devices and Materials, J.H. Braybrook, John Wiley &Sons, 1997\n-Handbook of Biomaterials Evaluation: Scientific, Technical and Clinical Testing of Implant Materials, 2nd Edition, A.F. von Recum, CRC Press, 1998."
            }
        },
        {
            "code": "MS4612",
            "title": "Drug Delivery and Tissue Engineering",
            "coreq": [],
            "prereq": [
                "MS4013"
            ],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4612_drug_delivery_and_tissue_engineering.pdf?sfvrsn=6d081737_10",
            "aus": 3,
            "type": "MPE",
            "instructor": [
                "Luciana Lisa Lao"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp01244"
            ],
            "semester": 2,
            "content": {
                "courseAims": "This prescribe d elective course aims to deepen your understanding on two major biomedical applications of materials. The course will equip you with the basic principles of drug delivery and tissue engineering and the important roles pla yed by biomaterials in these appli cations. It also presents engineering analyses of drug delivery along with biological and materials aspects of tissue engineering. All of this knowledge is essential for students who wish to specialize in medical materials  or pursue a career in the fields of drug delivery or tissue engineering.",
                "ilo": "By the end of the course, you should be able to:\n1. Define drug delivery, controlled release and targe ted delivery\n2. Compare and contrast the advantag es and limitations of various drug  delivery routes\n3. Illustrate the critical roles of polymers in drug delivery systems\n4. Explain the mechanisms and roles of materials in diffusion -controlled systems, osmotic -controlled and degradation -controlled drug delivery  systems\n5. Distinguish zero -order re lease from first -order release kinetics\n6. Estimate the drug release rate from diffusio n-controlled, osmotic -controlled and degradation -controlled drug delivery system\n7. Explain the mechanism and roles of materials in stimuli -responsive drug delivery systems\n8. Explain the principles of passive and active targeting in targeted delivery\n9. Define tis sue engineering and its contribution in regenerative medicine\n10. Describe the three main pillars that contribute to a successful tissue engin eered product\n11. Compare and contrast  the advantages and limitation of various cell sources for tissue engineering applic ations\n12. Analyze the major building blocks of extra -cellular matrix (ECM) and its functions as nature’s scaffold\n13. Explain the basic considera tions in design and materials sele ction for biomaterial scaffolds\n14. Describe various common scaffold fabrication methods\n15. Recognize different environmental factors (bioreactors and signalling) that affect tissue engineering",
                "courseContent": "• Fundamentals of  drug delivery\n• Controlled and targ eted delivery\n• Principles of tissue engineering\n• Biomaterial substrates for tissue engineering",
                "courseReference":"-Treatise on Controlled Drug Delivery, A.Kydonieus, Editor. Marcel Dekker, 1992.\n-Biomaterials Science, An Introduction to Materials in Medicine, B.D. Ratner, A.S.Hoffman, F.J. Schoen, J.E. Lemons, 3rd Edition, Academic Press, 2013\n-Handbook of Pharmaceutical Controlled Release Technology, D.L. Wise, 1st Edition,CRC Press, 2000.\n-Principles of Tissue Engineering, R.P.Lanza, R.Langer, J.Vacanti, Editors, 4th Edition,Academic Press, 2014.\n-Biomaterials for Tissue Engineering Applications,J.A. Budrick, R.L.Mauck, Editors.Springer-Verlag, 2011.\n-Bioreactor Systems for Tissue Engineering, T. Scheper, C. Kasper, M.Van-Griensven,R. Pörtner, Editors. Springer-Verlag, 2009."
            }
        },
        {
            "code": "MS4613",
            "title": "Wearable sensors for healthcare",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4613_wearable_sensors_for_healthcare.pdf?sfvrsn=eb667944_8",
            "aus": 3,
            "type": "MPE",
            "instructor": [
                "Chen Xiaodong"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00467"
            ],
            "semester": 1,
            "content": {
                "courseAims": "Wearable healthcare monitoring and diag nosis is an attractive topic in both biomedical research and industry. In this course, you will be introduced to the fundamentals of materials and processing technologies related to wearable healthcare application as well as the state-of-the-art integrated  healthcare devices. This course emphasizes an interdisciplinary knowledge buildup spanning from material science to electrical engineering for a small group of interested students. Hands-on device fabrication experiments are also offered to develop practical engineering abilities and innovative engineering minds. Students who are keen on learning and developing your own wearable healthcare monitoring solution should consider taking this course.",
                "ilo": "By the end of this cours e, you would be able to:\n1. Explain the basic principles of materials and device design and manufacturing techniques for healthcare related wearable applications.\n2. Describe key advanced integrated system on healthcare monitoring and diagnosis.\n3. Analyze and prop ose solutions for healthcare monitoring\n4. Design and fabricate healthcare related devices to achieve certain healthcare functions.",
                "courseContent": "Materials fundamentals for wearable sensors:\n• Electronic properties of materials\n• Flexible and stretchable sub strates for i ntegrated platform\n• Electrophysiological signals\n• Wireless technology\n\nMaterial processing and manufacturing technology\n• MEMS - Lithography and patterning\n• 3D printing, screen printing, inkjet printing\n\nAdvanced integrated devices for healthcare monitoring and diagnosis\n• E-textile\n• Printed electronics with functional application\n• Patchable systems for wearable sensors\n• Outlook\n\nLab Sessions on fabricating integrated devices for healthcare monitoring and diagnosis",
                "courseReference":"a.Wearable Electronics Sensors: For safe and heathy living, edited by Mukhopadhyay,Subhas C; Springer International Publishing, 2015.\nb.Flexible Electronics: Materials and Applications, edited by Wong, William S., Salleo,Alberto; Springer International Publishing, 2009."
            }
        },
        {
            "code": "MS4671",
            "title": " Introduction to Materials Simulation",
            "coreq": [],
            "prereq": [
                "MS1008",
                "MS0003"
            ],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4671_introduction_to_materials_simulation.pdf?sfvrsn=ee82060d_6",
            "aus": 3,
            "type": "MPE",
            "instructor": ["Zhao Yang"],
            "instructor_link": ["https://dr.ntu.edu.sg/cris/rp/rp00682"],
            "semester": 2,
            "content": {
                "courseAims": "The aim of this course is to introduce to year-4 students some of the most important computational modelling techniques for materials simulation, such as continuum methods, atomistic and molecular simulation methods, quantum mechanics methods, and machine learning techniques that includes artificial neural networks.\n\nStudents will gain insights into fundamental, theoretical, and numerical aspects of materials simulation thro ugh examples and exercises, appreciate the utility of computational modelling as an essential aid to uncover the underlying physics of experimental studies.",
                "ilo": "By the end of this course, you (as a student)  would be able to :\n1. Identify the utility of computational modelling as an essential aid to uncover the underlying physics of experimental studies.\n2. Explain various techniques of computational modelling of  materials.\n3. Differentiate between the usage of the continuum Finite Element Method, the atomistic Molecular Dynamics simulation method, and the ab -Initio Density Functional Theory method.\n4. Explain the fundamentals of quantum physics and their applications t o nanoscale materials.\n5. Explain different machine learning techniques an d their applications to materials datasets.\n6. Identify the utility of Design of Experiments and demonstrate the advantages of using machine learning based optimization to accelerated process development and achieve targets.",
                "courseContent": "Module I Basics of Modelling and Simulation (1 weeks, 1 tutorial)\n1. Why Model and Simulate? (1/3 week)\n- Why Model & Simulate\n- Examples\n- Advantages of simulations\n- Theoretical analysis and order-of-magnitude estimates\n\n2. Multiscale Modelling (1/3 week)\n- Length\n- Time\n- Energy/Temperature\n\n3. Methods of Modelling (1/3 week)\n- Process of simulation\n- Types of simulation\n- Software\n\nModule II Materials Simulation: Classical Methods (3 weeks, 3 tutorials)\n1. Finite Element Method (1 week)\n- Application\n- Limitation\n- Process\n\n2. Molecular Dynamics (1 week)\n- Procedure\n- Software\n- Applications\n\n3. Modelling Diffusion (1 week)\n- Heat diffusion: 1D and 2D\n- Particle Diffusion\n- Exciton Diffusion\n\nModule III Materials Simulation: Quantum Methods (3weeks, 3 tutorials)\n1. Introduction to Quantum Mechanics (1 week)\n- Notation in QM\n- Eigenstate and Eigenvalue\n- Schrödinger Equation\n- Particle in a box\n- Harmonic Oscillator\n- Plane Waves\n\n2. Tight Binding Model (1 week)\n- Direct and Reciprocal Lattice\n- Principles\n- Finite System Application\n- Infinite Periodic System Application\n\n3. Density Functional Theory (DFT) (1 week)\n- Principles\n- Applications\n\nModule IV Materials Simulation: Machine Learning (4 weeks, 4 tutorials)\n1. Review of Machine Learning Basics (1 week)\n- Demonstrate data analysis and optimization tools in python\n- Linear regression\n- Overfitting/regularization\n- Classification algorithms\n- Unsupervised learning: clustering/PCA\n\n2. Regression Models and Artificial Neural Networks (1 week)\n- Principles\n- Building models, Feature Importance for root cause analysis, SHAP Analysis\n- Convolutional Neural Networks for image data\n- Finite System Application example – Images and other materials science datasets.\n\n3. Design of Experiments and Optimization for experiments (2 weeks)\n- Principles\n- Gradient-based, gradient-free approach, constrained and unconstrained optimization\n- Exploration vs Exploitation, Local vs Global Optimization\n- Demonstrate data analysis and optimization tools in python to analyze the dataset\n- Real-life examples",
                "courseReference":"There is no single textbook for the course. The following books and resources will be used as references and if necessary, notes will be provided.\n\n1. The Practice of Computing Using Python: W. Punch and R. Enbody (3rd edition, Pearson).\n2. Principles of Quantum Mechanics: R. Shankar (2nd Edition, Plenum Press)\n3. Applied Finite Element Analysis: L. J. Segerlind (2nd Edition, Wiley).\n4. Electronic Structure: Basic Theory & Practical Methods: R. M. Martin (Cambridge Univ Press).\n5. An Introduction to Machine Learning: E. Alpyadin (3rd edition, Cambridge MS, MIT press).\n6. Artificial Intelligence: A Modern Approach: S. Russell and P. Norvig (3rd edition, Pearson)."
            }
        },
        {
            "code": "SC2002",
            "title": "Object Oriented Design and Programming",
            "coreq": [],
            "prereq": [
                "SC1003",
                "SC1007"
            ],
            "link": "",
            "aus": 3,
            "type": "MPE",
            "instructor": [],
            "instructor_link": [],
            "semester": 999
        },
        {
            "code": "SC3061",
            "title": "Human-Computer Interactions",
            "coreq": [],
            "prereq": [
                "MS1008",
                "MS0003"
            ],
            "link": "",
            "aus": 3,
            "type": "MPE",
            "instructor": [],
            "instructor_link": [],
            "semester": 999
        },
        {
            "code": "SC1007",
            "title": "Data Structures & Algorithms",
            "coreq": [],
            "prereq": [
                "SC1003"
            ],
            "link": "",
            "aus": 3,
            "type": "MPE",
            "instructor": [],
            "instructor_link": [],
            "semester": 999
        },
        {
            "code": "MS4601",
            "title": "Principles of Semiconductor Designs",
            "coreq": [],
            "prereq": [],
            "link": "",
            "aus": 3,
            "type": "MPE",
            "instructor": [],
            "instructor_link": [],
            "semester": 999
        },
        {
            "code": "MS4603",
            "title": "Microelectronic Process Integration",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4603_microelectronics_process_integration.pdf?sfvrsn=b44f85c0_8",
            "aus": 3,
            "type": "MPE",
            "instructor": [
                "Nripan Mathews",
                "Lee Pooi See"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00211",
                "https://dr.ntu.edu.sg/cris/rp/rp00251"
            ],
            "semester": 2,
            "content": {
                "courseAims": "The major objective of th is subject is to introduce the students to the materials and engineering aspects of Silicon microelectronic device integration. Module technologies will be introduced, following by thin film processes used in device integration and  other processing module technologies. Successful completion of this subject should give the students an in -depth understanding of microelectronic device processing and integration, and help them to appreciate the materials design requirements of metal oxi de semiconductor devices.  In addition, the students will be familiarized with the potential applications of semiconductor devices.",
                "ilo": "By the end of this course, you (as a student) would be able to:\n1. Identify and select suitable materials, deposition methods and integration processes based on materials properties and processing techniques.\n2. Explain the various integration processing modules and their applications for advanced semiconductor technology.\n3. Apply basic device and integration knowledge to solve processing and manufacturing issues.",
                "courseContent": "· Advanced Gate Stack and Substrate Engineering\n· Contacts Formation and Source-Drain Metallization\n· Low K Dielectrics and Diffusion barriers",
                "courseReference":"List of readings and references used in the course\nPrimary: C. Y. Chang and S. M. Sze, ULSI Technology, McGraw Hill 2001.\nSecondary: Stanley Wolf, Silicon Processing for the VLSI Era: Vol 2: Process Integration,5th edition, Lattice Press."
            }
        },
        {
            "code": "MS4621",
            "title": "Selected Topics on Applied Polymer Materials",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4621_polymer_science.pdf?sfvrsn=acbf76f2_18",
            "aus": 2,
            "type": "MPE",
            "instructor": [
                "Lu Xuehong"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00263"
            ],
            "semester": 1,
            "content": {
                "courseAims": "This is an advanced-level polymer course. The objectives are to provide Materials Engineering students with specialized knowledge on commonly used engineering polymers and polymerization techniques, and train them how to select suitable polymers for different engineering and functional applications.",
                "ilo": "By the end of this course, student s will be able to:\n1. differentiate elastomers, thermoplastics & thermosets based on their chemical structures, mechanical properties and processability;\n2. identify key structural factors affecting properties of elastomers, thermosets, rigid-chain polymers and rubber -toughened  polymer systems, respectively;\n3. explain structure-property relationships for the engineering and functional polymers covered in this course;\n4. select suitable polymers for common engineering applications based on the structures of the polymers;\n5. select polymerisation techniques to obtain polymer products with desired features.",
                "courseContent": "1. Overview of polymer structures and structure-property relationships\n2. Elastomeric network polymers: rubber elasticity theory, structures and properties of typical rubbers and thermoplastic elastomers, application issues including stress relaxation caused by Thirion relaxation & bond exchange, combined effects of temperature and frequency on properties\n3. Rigid thermosetting polymers: structures and properties of epoxy resins including cure reactions, effects of cure and vitrification on properties, concept of vitrimers, structures and properties of unsaturated polyesters and their unique features\n4. Rubber-toughened & ultratough polymers: rubber-toughening mechanisms, rubber-toughened plastics including HIPS, ABS  and rubber particle -toughened PMMA, particle -toughend epoxy resins , structures and properties of ultratough UHMWPE  and its application issues\n5. Rigid -chain polymers: structures and properties of aromatic polyimides, hyperbranched polyim ides, definitions of liquid crystalline phases, classification of liquid crystalline polymers (LCPs), structures and properties of typical thermotropic and lyotropic LCPs\n6. Common polymerization techniques: conventional bulk polymerization, UV-induced stereolithography, suspension polymerization, emulsion polymerization  and the mechanism, solution polymerization\n7. CA1 and feedback\n8. Introduction to functional polymers : student group projects & presentations",
                "courseReference":"Joel R. Fried, Polymer Science and Technology, 3rd Edition, Prentice Hall, 2014.\nBrydson's Plastics Materials, 8th Edition, edited by Marianne Gilbert, Elsevier Ltd., 2017.\nAnil Kumar, Rakesh K. Gupta, Fundamentals of Polymer Engineering, 3rd Edition, CRC press, 2018."
            }
        },
        {
            "code": "MS4622",
            "title": "Composite Materials",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4622_composite_materials.pdf?sfvrsn=d8c49cc8_11",
            "aus": 3,
            "type": "MPE",
            "instructor": [
                "Yu Jing"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00432"
            ],
            "semester": 2,
            "content": {
                "courseAims": "Composite materials are multi-phase materials obtained by artificial combination of  different materials so as to  attain properties that the individual components by themselves cannot attain. The physical and chemical properties of composites strongly depend not only on their compositions but also on their structure, morphology, phase, shape, size, distribution, and spatial arrangement.\n\nThe main objective of this course is not only to enlarge your knowledge in functional composite materials, which includes their structural/traditional, thermal, electrical, electromagnetic, thermoelectric, electromechanical, dielectric, magnetic, optical, electrochemical and biomedical properties, but also to empower the students with the skills needed for the design, manufacture and analysis of composite materials from a material scientist’s viewpoint.",
                "ilo": "By the end of this course, student will be able to:\n1. Articulate the basic concepts and types of composite materials with examples.\n2. Describe basic concepts of the composite matrix (polymer, metal, and ceramic) with pros and cons.\n3. Classify the different fiber types and fiber spinning processes.\n4. Explain how different types of bonding affect the interfaces.\n5. Apply knowledge to explain the behavior of unidirectional composites.\n6. Classify the types of metal matrix composites and respective processes.\n7. Explain the processing of ceramic matrix composites.\n8. Describe the basic processes to fabricate polymer matrix composites.\n9. Evaluate various nanocomposites based on their applications.\n10. Reflect the concept of biomaterials (biocomposites, biofiber, etc.) to discuss future market opportunities.",
                "courseContent": "1. Introduction to composite materials\n2. Matrix materials\n3. Reinforcement\n4. Interfaces\n5. Mechanical properties of composite materials\n6. Polymer based composites\n7. Metal matrix and ceramic matrix composites\n8. Carbon based composites and nanocomposites\n9. Biocomposites\n10. Functional composite materials",
                "courseReference":"· Krishan K. Chawla, Composite Materials. 2nd Edition, Springer Press, 2001.\n· Deborah D. L. Chung, Composite Materials: Science and applications, Springer, 2004.\n· Harsuo Ishida Characterization of composite materials, Butterworth Heinemann, 1994.\n· Navin Chand and Mohammed Fahim, Tribology of natural fiber polymer composites, CRC Press, 2008."
            }
        },
        {
            "code": "MS4630",
            "title": "Photovoltaic and Energy Storage",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4630_photovoltaic_devices_and_energy_storage.pdf?sfvrsn=7ca397f5_8",
            "aus": 3,
            "type": "MPE",
            "instructor": [
                "Yan Qingyu",
                "Lam Yeng Ming"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00845",
                "https://dr.ntu.edu.sg/cris/rp/rp01069"
            ],
            "semester": 2,
            "content": {
                "courseAims": "The course aims to introduce the concept of energy harnessing and energy storage technology through photovoltaics and batteries.\n\nThis course aims to give you a general introduction of materials used in photovoltaic devices and energy storage de vices. As a student, you would learn the fund amentals of how such devices operate and how those materials could be prepared. You would also learn the device structures and know the limit of the performance of such devices and understand the possible direction for future improvement.\n\nYou would be taught how materials selection and properties, which are strongly influenced by the device design and fabrication processes, affect the efficiency of the PV cell.\n\nYou also will learn various energy storage technologies, which are being used in market or under development for the future (energy storage, supercapacitor and batteries concepts, lithium ion battery technology). We will focus more on electrochemical energy storage on various batteries including primary and rechargeable ones. Fundamental principles will be given on illustrate the working mechanism of these devices.",
                "ilo": "By the end of this course, you (as a student)  would be able to:\n1. Explain the basic principles of photovoltaic devices\n2. Evaluate PV device performance usi ng standard performance matrix\n3. Describe the different PV technologies including their advantage and disadvantages\n4. Describe how PV device are fabricated\n5. Perform materials selection for fabricating an efficient PV device\n6. Propose improvement on PV device design\n7. Identify factors that affect the performance of a PV device from materials selection and device fabrication.\n8. Explain the basic concepts behind electrochemical cells\n9. Describe the structures, properties and working principles of key energy storage devices such as supercapacitors, primary and secondary batteries (such as lithium ion battery)\n10. Identify the potential, risk and limitations of different types of energy storage devices\n11. Select materials when designing an energy storage device to meet expected requirements such as higher durability, etc.\n12. Evaluate the performance of energy storage devices using standard performance metrics; and\n13. Improve their performance by taking into consideration their structures, properties and working principles and the propert ies of available materials.",
                "courseContent": "1. Basics of Photovoltaic devices\n2. Electrical Characterizations of PV devices\n3. Silicon solar cell\n4. Thin film solar cell\n5. Third generation solar cell\n6. Electrochemical cells,\n7. Supercapacitors,\n8. Primary battery,\n9. Seco ndary battery,\n10. Li ion battery",
                "courseReference":"· Nelson, J. The Physics of Solar Cells, Imperial College Press, 2003.\n· T. Dittrich, Materials Concepts for Solar Cells, Imperial College Press, 2015\n· Luque, A. (Antonio), Handbook of photovoltaic science and engineering [electronic resource], Wiley,2003.\n· Robert Huggins, “Energy storage : fundamentals, materials and applications”, 2nd Ed.,Wiley, 2001"
            }
        },
        {
            "code": "MS4631",
            "title": "Corrosion Engineering",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4631_corrosion_engineering.pdf?sfvrsn=227d2615_2",
            "aus": 3,
            "type": "MPE",
            "instructor": [
                "Huang Yizhong"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00979"
            ],
            "semester": 1,
            "content": {
                "courseAims": "The main objectives are:\n1. To understand the aspects of practical corrosion problems and solutions, the corrosion behaviour of engineering materials, and the methods and techniques for testing and monitoring of corrosion.\n2. To learn the basic principles of non-destructive methods and their similarities difference, capabilities, limitations and applications in the detection of corrosion-related defects.",
                "ilo": "On completion of this course, the students should be able to:\n• Understand and differentiate different non- destructive methods\n• Select an appropriate non- destructive method for a particular requirement.\n• Analyze corrosion problems of industry\n• Apply appropriate techni ques for testing and monitoring corrosion\n• Select appropriate material and technology for a given application",
                "courseContent": "Corrosion in various materials; Corrosion in various environments; Corrosion prevention technologies; Corrosion Testing and Monitoring Techniques – Destructive and Non-destructive testing",
                "courseReference":"Suggested reading:\n\n  Prescribed Texts:\n- 1. Electrochemistry by Carl Hamann, et. al., 2ed ed. Wiley-VCH press 2007.\n- 2. M. G. Fontana, Corrosion Engineering, 3rd edition, McGraw-Hill, 1987.\n- 3. D. A. Jones, Principles and Prevention of Corrosion, 2nd Edition, Prentice-Hall, 1996\n\nRecommended references:\n- Principles and Prevention of Corrosion by Denny Jones, 2nd ed., Prentice-Hall\n- Corrosion Engineering by Mars G. Fontana, 3rd ed.\n - NACE Corrosion Engineer’s Reference Book by R. Baboian, 3rd ed, NACE Press."
            }
        },
        {
            "code": "MS4642",
            "title": "Additive Manufacturing of Materials",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4642-additive-manufacturing-of-materials.pdf?sfvrsn=b3a7c334_12",
            "aus": 1,
            "type": "MPE",
            "instructor": ["Lai Changquan"],
            "instructor_link": [],
            "semester": 1,
            "content": {
                "courseAims": "The aim of this course is to provide a practical overview of Additive Manufacturing (AM) techniques and the impact of their process flows on the properties of the materials produced. Students will be taught how to critically evaluate the advantages, limita tions and material compatibility of each AM technique.\n\nThe coursework will provide students with the means to select the most appropriate AM technique and optimize the processing parameters for their needs. It will also include recent advances in AM to ensure students stay abreast with the most cutting-edge developments, allowing their knowledge to be relevant and industry-ready upon graduation.\n\nThis course is most suitable for material scientists and engineers who would like to understand more about the possibilities of material processing through AM and for process engineers and scientists to understand more about the effect of AM processes on the material properties.",
                "ilo": "By the end of this course, you (as a student) w ould be able to:\n1. List and describe the 7 major categories of Additive Manufacturing (AM)\n2. Understand the working principles of each technique\n3. Explain the advantages and limitations of each technique\n4. Explain how the process flow of each technique affects material compatibility and performance\n5. Identify material defects and explain they arise\n6. Demonstrate knowledge on the applicability of AM materials",
                "courseContent": "1. Introduction to Additive Manufacturing: What is it? Why is important? Latest news.\n2. Additive Manufacturing: Software; Basic e xplanation and preparation of STL files and gcode\n3. Short overview  on the fundamentals of material elasticity and viscoelasticity, mechanics of materials, microstructures\n4. Description of the 7 categories of Additive Manufacturing – process flow; advantages and limitations; effect on material compatibility and performance (dimensional stability, structural properties etc.)\n5. Effect of processing parameters on defect formation",
                "courseReference":"1.'3D Printing and Additive Manufacturing: Principles and Applications', 5th edition, World Scientific(2017)\n 2. Additive Manufacturing Technologies Hardcover (2020)by Ian Gibson (Author), David Rosen (Author), Brent Stucker (Author), Mahyar Khorasani (Author)\nISBN-10 : 3030561267\nISBN-13 : 978-3030561260"
            }
        },
        {
            "code": "MS4663",
            "title": "Engineering Solutions by Design Thinking",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4663_engineering_solutions_by_design_thinking.pdf?sfvrsn=f2bd67af_8",
            "aus": 3,
            "type": "MPE",
            "instructor": [
                "Tan Lay Poh"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00888"
            ],
            "semester": 1,
            "content": {
                "courseAims": "In this course you w ill engage with the versatile investigation and problem-solving process known as design thinking. You will experience new ways of gaining insights when designing for a situation, where the emphasis is on human considerations, as you develop a process, and respond with solutions that are appropriate to the intended audience. This course will compliment any discipline of design, technology, development, or production were the final result will involve human participation.",
                "ilo": "By the end of this course, you (as a student)  would be able to:\n1. Describe the ideology and processes of design thinking and how it differs from other design and development methods.\n2. Develop a unique design process that is in response to a specific human-centred situation.\n3. Apply creative and inventive techniques to develop a responsive design concept through to prototype stage.\n4. Demonstrate a prototype solution supported with rationale that responds to human-centred situation.\n5. Constructively discuss and critique design thinking approaches, processes and solutions employed by peers.",
                "courseContent": "In this course, you will bring your own discipline’s experience to the creative process of design thinking. You will join up in teams with students from different backgrounds, and together you will employ an innovative investigation processes to understand a topic and respond with creative solutions.",
                "courseReference":"1. Borgmann, A. (1995). *The depth of design*. In R. Buchanan & V. Margolin (Eds.), *Discovering design: Explorations in design studies* (pp. 13-22). Chicago, IL: The University of Chicago Press.\n\n2. Brown, T., & Wyatt, J. (2010). Design thinking for social innovation. *Stanford Social Innovation Review, 8*(1), 30-35.\n\n3. Brown, T., & Katz, B. (2009). *Change by design: How design thinking transforms organizations and inspires innovation*. Harper Business.\n\n4. Buchanan, R. (1992). Wicked problems in design thinking. *Design Issues, 8*(2), 5-21.\n\n5. Dorst, K. (2011). The core of ‘design thinking’ and its application. *Design Studies, 32*(6), 521-532.\n\n6. Gray, C., & Malins, J. (2004). *Visualizing research*. Ashgate.\n\n7. IDEO. (n.d.). *The Field Guide to Human-Centred Design*. Retrieved from http://www.designkit.org//resources/1\n\n8. IDEO. (n.d.). Retrieved from http://www.ideo.com\n\n9. Kelly, T., & Littman, J. (2001). *The art of innovation: Lessons in creativity from IDEO, America’s leading design firm*. Harper Collins Business.\n\n10. Kolko, J. (2010). Abductive thinking and sensemaking: The drivers of design synthesis. *Design Issues, 26*(1), 15-28.\n\n11. Myerson, J. (2004). *IDEO: Masters of innovation*. Laurence King.\n\n12. Noble, I., & Bestley, R. (2004). *Visual research: An introduction to research methodologies in graphic design*. Ava Publishing.\n\n13. Patnaik, D., & Mortensen, P. (2009). *Wired to care: How companies prosper when they create widespread empathy*. FT Press.\n\n14. Pilloton, E., & Chochinov, A. (2009). *Design revolution: 100 products that are changing people’s lives*. Thames & Hudson.\n\n15. Schön, D. (1983). *The Reflective Practitioner*. London: Temple-Smith.\n\n16. Schön, D. (1992). Designing as reflective conversation with the materials of a design situation. *Knowledge-Based Systems, 5*(1), 3-14.\n\n17. Stanford d.school. (n.d.). *Bootcamp Bootleg*. Retrieved from https://dschool.stanford.edu/resources/design-thinking-bootleg\n\n18. Winner, L. (1980). Do artifacts have politics? *Daedalus, 109*(1), 121-136.\n\n* This list will be continually updated as new research and resources become available."
            }
        },
        {
            "code": "MS4664",
            "title": "Environmental Sustainability & Materials",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4664_environmental_sustainability_and_materials.pdf?sfvrsn=834ec3a9_6",
            "aus": 3,
            "type": "MPE",
            "instructor": [
                "Andrew Clive Grimsdale"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00684"
            ],
            "semester": 2,
            "content": {
                "courseAims": "The objectives of this course are to introduce you to the environmental aspects of materials, and the role materials engineers play in building a sustainable environment, including topics such as the principles of green design, industrial ecology, product life cycle assessment, and relevant materials research for environmental and energy applications.\n\nThis course will be helpful to students intending to specialize in environmentally conscious product design and manufacturing processes involving the usage of modern materials.",
                "ilo": "1. Understand the broad principles of environmental engineering.\n2. Understand the environmental impacts of materials and chemical processing.\n3. Evaluate and critically assess environmental life cycles of various materials.\n4. Evaluate and describe advanced material usage in energy and environmental applications.",
                "courseContent": "1. Introduction to environmental issues and sustainability\n2. The essential natural environmental cycles\n3. Carbon cycle and climate change\n4. Environmental remediation – Soil and Water\n5. Sustainable concepts for food production\n6. Competing energy sources\n7. Renewable energy sources\n8. Energy transport and storage\n9. Materials life cycles, life cycle analyses, and eco-audits 1\n10. Materials life cycles, life cycle analyses, and eco-audits 2\n11. Case studies and materials selection 1\n12. Case studies and materials selection 2",
                "courseReference":"Textbook\nMichael Ashby, Materials and the Environment, Butterworth-Heinemann, 2013"
            }
        },
        {
            "code": "MS4665",
            "title": "Sustainable Development in Water, Agriculture and Aquaculture",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4665_sustainable_development_in_water_agriculture_and_aquaculture.pdf?sfvrsn=3c91e711_12",
            "aus": 2,
            "type": "MPE",
            "instructor": ["Michael Tam"],
            "instructor_link": [],
            "semester": 2,
            "content": {
                "courseAims": "In this prescribed elective, students will be introduced to critical industrial sectors, namely water, agriculture and aquaculture, where sustainable development concepts that integrate these three sectors will be discussed. The students will learn key concepts on water, agriculture and aquaculture, and how materials science and engineering can be applied to manage and advance these sectors in a sustainable manner. The course will integrate knowledge learnt with practical applications through a team project that allows these students to analyze and propose solutions that facilitate sustainable development in these three sectors. Student teams will be encouraged to collaborate with industry in scoping the project, analyze and propose solutions that address the specific problem encountered by industry.",
                "ilo": "By the end of this course, student  will be able to:\n1) Acquire knowledge relating to water, agriculture  and aquaculture, and understand the inter-relationship between these three sectors.\n2) Understand the principles relating to the sustainable development in water, agriculture and aquaculture.\n3) Critically assess problems relating to the sustainable development in water, agriculture and aquaculture\n4) Apply knowledge and critical thinking to develop solutions that promote the sustainable development in these three sectors.\n5) Demonstrate their capacity to work in teams, and to network and collaborate with practitioners of these industrial sectors.\n6) Deliver clear and compelling oral presentation of their analyses and results and defend their proposed solutions.",
                "courseContent": "1. Introduction to water, agriculture and aquaculture\n2. Sustainability concepts and their relationship to water, agriculture, and aquaculture\n3. Sustainable development in water: water conservation, purification and recycling. Application and use of sustainable materials on water treatment systems\n4. Sustainable development in agriculture: nutrients delivery and management, pesticide delivery and applications, water management and control, nutrients and pesticide leaching and management of pollution of water bodies\n5. Sustainable development in aquaculture: water and nutrient management, sustainable antimicrobial system to manage infection and health of marine animals\n6. Relationship between water, agriculture and aquaculture - application of sustainable concepts in the three sectors.",
                "courseReference":"· Charlesworth, Susanne; Booth, Colin; Adeyeye, Kemi, editors., Sustainable Water Engineering, Elsevier, Netherlands, 2021 (ISBN: 978-0-12-816120-3)\n· Brassley, Paul; Soffe, Richard, Agriculture: A Very Short Introduction, Oxford University Press, 2016 (ISBN-13: 978-0-19-872596-1)\n· Mohammed, Stephanie, Tomorrow’s Agriculture “NFT Hydroponics”-Grow within Your Budget, Springer, 2018 (ISBN13: 978-0-86-417527-4)\n· Hai, Faisal I.; Visvanathan, Chettiyappan; Boopathy, Ramaraj, Sustainable Aquaculture, Springer International Publishing, 2018 (ISBN: 978-3-31-973257-2)"
            }
        },
        {
            "code": "MS4666",
            "title": "Environmental Sustainability & Materials",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4666_environmental_degradation_of_plastics.pdf?sfvrsn=59cfe0ec_9",
            "aus": 1,
            "type": "MPE",
            "instructor": [
                "Dalton Tay Chor Yong"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00189"
            ],
            "semester": 1,
            "content": {
                "courseAims": "The course aims to provide a broad overview on the various physical and chemical processes of plastic weathering and the potential harm it may exert to the environment – through the lens of materials scientists.  The module is designed to foster and develop student’s knowledge of issue pertaining to plastics weathering testing, characterisation, mechanisms of polymer degradation and microplastics pollution. Based on the imparted knowledge, students will be encouraged to be aware and think critically on the societal-environment caused by plastic weathering.",
                "ilo": "By the end of this course, you (as a student)  would be able to:\n1. Describe the physical and chemical changes associated to plastic degradation\n2. Recommend and justify the appropriate characterisation techniques to examine plastics degradation\n3. Explain the molecular mech anisms of photooxidation and biodegradation of plastics\n4. Understand the different and the working principles of stabilization additives to limit plastic degradation\n5. Demonstrate knowledge on the process of microplastics generation and possible associated environmental harm",
                "courseContent": "1. Physicochemical changes and characterization of weathered plastic materials\n2. Photo -oxidation of polymers: Principles and mechanism; Photo -chemistries and oxidation; Photo stabilization of polymers with the use of additives (e.g. pigments, UV absorb ers, antioxidants, etc)\n3. Biodegradation of polymers: Micro -organism mediated enzy matic degradation; materials factors influencing biodegradation rate; Protection against biodegradation; Approaches to examine biodegradation.\n4. Microplastics pollutio n: Primary and Secondary Microplastics; Microplastics characterisation; interaction of microplastics and chemical pollutants; Biological impact of microplastics.",
                "courseReference":"Nil"
            }
        },
        {
            "code": "MS4667",
            "title": "Introduction to Sustainable Materials",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4667_introduction_to_sustainable_materials.pdf?sfvrsn=b293557f_3",
            "aus": 2,
            "type": "MPE",
            "instructor": [
                "Xiaolei Feng"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp02119"
            ],
            "semester": 1,
            "content": {
                "courseAims": "The new course will introduce stude nts to the challenges arising from our increased use of materials through the last century or more. Aspects of developing, using and recycling materials in a sustainable way will be explored through a focus on the five key materials that (arguably) have most impact on the environment: steel, cement, aluminum, plastics and paper. This course will be helpful to students keen on building an understanding of the impacts of materials on the environment and, forward looking, the use of materials in ways to secure a sustainable future. This course will also touch on fundamental skills for students interested in policy, decision making and the application of sustainability concepts to modern life.",
                "ilo": "By the end of this course, student will be able to:\n1. Describe what  we are worried about regarding future sustainability as materials scientists/engineers, understand key concepts related to sustainability, understand environmental impacts of our increasing demands of materials, and desc ribe the challenges of making a big difference towards a sustainable future\n2. Explain top five key materials  that drive the industrial car bon emissions\n3. Describe the use of recycled materials – the metals, and  to some extent paper and plastics can be recycled which affects sustainability , as the emissions and energy used to recycle these materials is usually much less than to  produce fresh  material.\n4. Describe materials journey, including their flows, stocks  and demand.\n5. Evaluate  the energy and em issions in making materi als, like steel .\n6. Critically evaluate which processes emit the most greenhouse gases, in response t o concerns rel ated to climate change.\n7. Explain the factors that limit energy efficien cy in materials production and approaches to  optimise energy efficiency.\n8. Demonst rate knowledge on novel process routes and clean energy that would red uce our total emission.\n9. Explain where CO2 can be stored, what are the risks of storing CO 2, and what  the energy and money costs of storing CO 2.\n10. Demonstrate their ca pacity to work in teams, and to network and collaborate with practitioners for real-world problems.",
                "courseContent": "1. Material wealth and health – Why are we worried about a sustainable future? Challenges o f makin g a big difference towards a sustainable future\n2. Top five materials that drive the industrial carbon emis sions – why steel and aluminium are most heavily consumed metals that make Singapore as it is today? use of recycled materials – the metals, and to some extent paper and plas tics can be rec ycled which affects sustainability\n3. Metal journeys. Flow from o re to final uses . How has the demand built to present levels? What stocks of steel and aluminum goods exist today? How will the demand develop in future?\n4. CO2 emissions a rising from the  material production processes.\n5. Energy uses in making steel an d aluminum compo nents.\n6. Energy efficiency in existing processes and how to push the limits to future energy efficiency.\n7. Opportunities for capturing heat.\n8. Novel process routes and clean energy that would reduce our total emission.\n9. Carbon sequestration. W here can CO2 be stored ? What are the risks of storing CO2?\n10. A special case study\n\nA guest lecture(s) (at least 2) will be organized on one or two of the teaching weeks depending on the availability of the external speakers. Minor adjustme nts to the weekly schedule will be done while ensuring all planned topics are covered.",
                "courseReference":"Text Book\n\n1. Julian M Allwood & Jonathan M Cullen, Sustainable Materials without the hot air, UIT Cambridge Ltd, 2015\n\n2. Cleaver, C., Azevedo, J., Horton, P., & Allwood, J. M. (2022). Materials & Manufacturing: Business growth in a transformative journey to zero emissions. Apollo - University of Cambridge Repository. https://doi.org/10.17863/CAM.79915\n\n3. Allwood, J. (2021). Entrepreneurs not Emissions: New business opportunities to fill the gap in UK emissions policy. Apollo - University of Cambridge Repository. https://doi.org/10.17863/CAM.76789\n\nAdditional Resources\n\n1. IPCC, 2023: Climate Change 2023: Synthesis Report. A Report of the Intergovernmental Panel on Climate Change. Contribution of Working Groups I, II and III to the Sixth Assessment Report of the Intergovernmental Panel on Climate Change [Core Writing Team, H. Lee and J. Romero (eds.)]. IPCC, Geneva, Switzerland, (in press)\n\n2. IPCC, 2023: Summary for Policymakers. In: Climate Change 2023: Synthesis Report.A Report of the Intergovernmental Panel on Climate Change. Contribution of Working Groups I, II and III to the Sixth Assessment Report of the Intergovernmental Panel on Climate Change [Core Writing Team, H. Lee and J. Romero (eds.)]. IPCC, Geneva, Switzerland, (in press).\n\n3. IPCC, 2023: Annex I: Glossary [Reisinger, A., D. Cammarano, A. Fischlin, J.S. Fuglestvedt, G. Hansen, Y. Jung, C. Ludden, V. Masson-Delmotte, R. Matthews, J.B.K Mintenbeck, D.J. Orendain, A. Pirani, E. Poloczanskaa, and J. Romero (eds.)]. In: Climate Change 2023: Synthesis Report. Contribution of Working Groups I, II and III to the Sixth Assessment Report of the Intergovernmental Panel on Climate Change [Core Writing Team, H. Lee and J. Romero (eds.)]. IPCC, Geneva, Switzerland, (in press)\n\n4. IPCC, 2023: Annex II: Acronyms, Chemical Symbols and Scientific Units [Fischlin, A., Y. Jung, N. Leprince-Ringuet, C. Ludden., C. Péan, J. Romero (eds.)]. In: Climate Change 2023: Synthesis Report. Contribution of Working Groups I, II and III to the Sixth Assessment Report of the Intergovernmental Panel on Climate Change [Core Writing Team, H. Lee and J. Romero (eds.)]. IPCC, Geneva, Switzerland, (in press)"
            }
        },
        {
            "code": "EM5101",
            "title": "Environmental Quality",
            "coreq": [],
            "prereq": [],
            "link": "",
            "aus": 3,
            "type": "MPE",
            "instructor": [],
            "instructor_link": [],
            "semester": 999
        },
        {
            "code": "EM5104",
            "title": "Air Quality Management",
            "coreq": [],
            "prereq": [],
            "link": "",
            "aus": 3,
            "type": "MPE",
            "instructor": [],
            "instructor_link": [],
            "semester": 999
        },
        {
            "code": "EM5109",
            "title": "Environmental Issues and Sustainability",
            "coreq": [],
            "prereq": [],
            "link": "",
            "aus": 3,
            "type": "MPE",
            "instructor": [],
            "instructor_link": [],
            "semester": 999
        },
        {
            "code": "MS4640",
            "title": "Advanced Analysis of Materials",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4640_advanced_analysis_of_materials.pdf?sfvrsn=d5417091_8",
            "aus": 3,
            "type": "MPE",
            "instructor": [
                "Dong Zhili",
                "Wu Dongshuang"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp01163",
                "https://dr.ntu.edu.sg/cris/rp/rp02036"
            ],
            "semester": 1,
            "content": {
                "courseAims": "This course will equip you with the  analytical tools and methods needed to conduct nanometric assessments of inorganic materials at the atomic scale. This course is designed to prepare you for the  solution of real-world problems in industry or to support postgraduate studies that will rely heavily upon advanced X-ray and electron beam methods for nanomaterials characterization. This course will further help you understand the operation procedures of various X-ray diffractometers and electron microscopes with the sufficient theoretical knowledge.",
                "ilo": "By the end of this course, you (as a student)  would be able to:\n1. Identify the capabilities and limitations of each of the crystal structure analysis techniques covered in the syllabus.\n2. Select the appropriate technique for an investigative work.\n3. Perform data analysis and interpretation of results obtained from XRD and TEM.\n4. Successfully apply the characterisation techniques leaned to the final year projects.",
                "courseContent": "This course focuses on the advanced cryst al structure analysis techniques, with emphasis on the following topics:\n1. Basics of Crystallography\n2. Advanced X-ray Diffraction techniques\n3. Advanced Transmission Electron Microscopy\n4. Integration of results for nanomaterials analysis",
                "courseReference":"Textbooks/References\n\n1. Elton N. Kaufmann (Editor), Characterization of Materials, John Wiley & Sons, 2003.\n\n2. P.J.Goodhew and F.J.Humphreys, Electron Microscopy and Analysis, Taylor & Francis, second edition, 1992.\n\n3. J.I. Goldstein, D.E. Newbury, P. Echlin, D.C. Joy, C. Fiori and E. Lifshin, Scanning Electron Microscopy and X-Ray Microanalysis, New York: Kluwer Academic/Plenum Publishers, 2003.\n\n4. I.A.Watt, The principles and practice of electron microscopy, Cambridge, 1989.\n\n5. M.H.Loretto, Electron beam analysis of materials, Chapman & Hall, 1988.\n\n6. R. Wiesendanger, Scanning Probe Microscopy, Berlin; New York: Springer-Verlag, 1998."
            }
        },
        {
            "code": "MS4650",
            "title": "Functional Nanostructured Materials",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4650_functional_nanostructured_materials.pdf?sfvrsn=6eb768_17",
            "aus": 3,
            "type": "MPE",
            "instructor": [
                "Xue Can"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00851"
            ],
            "semester": 2,
            "content": {
                "courseAims": "The purpose of this course is to provide the students some detailed knowledge of functional nanostructured materials, such as self-assembled nanoparticles and their applications, nanoporous materials and their production, and nano-sized biomaterials and their functions.",
                "ilo": "By the end of this course, you (as a student) would be able to:\n1. Identify common interactions between molecules and nanoparticles;\n2. Describe general synthesis and fabrication techniques for functional nanomaterial systems covered in the course\n3. Describe structures of the nanomaterial systems and identify suitable techniques for structural characterization\n4. Explain the relationship between the structures and properties\n5. Give applications of these functional nanostructured materials with examples\n6. Define micelles and describe the building blocks of micelles\n7. Expla in how micelles are formed through micellization thermodynamics\n8. Describe the formation of bilayers and contrast them from micelles\n9. Define liposomes and illustrate the synthesis process of liposomes\n10. Describe the principles of self-assembly at interfaces of Langmuir-Blodgett (LB) Film and Self-Assembled Monolayer (SAM)\n11. Discuss major applications of nanostructured materials in cosmetics and medicine",
                "courseContent": "General introduction of nanostructured materials. Case studies of nanomaterial systems in term of the synthesis, structures, characterization and applications; for example, synthesis and characterization of nanoporous materia ls for separation and purificat ion applications; self-assembly of various nanostructured materials such as micelles, bilayers and liposomes and their use for medical and cosmetic applications.",
                "courseReference":"a. Cao Guozhong, Nanostructures and Nanomaterials -Synthesis, Properties and Applications, Imperial College Press,2004\nb. Yoon, S. Lee, Self-Assembly and Nanotechnology: A Force Balance Approach,Wiley,2008"
            }
        },
        {
            "code": "MS4651",
            "title": "Thin Film Technology",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4651_thin_film_technology.pdf?sfvrsn=ca44e680_8",
            "aus": 3,
            "type": "MPE",
            "instructor": [
                "Xue Can"
            ],
            "instructor_link": [
                "https://dr.ntu.edu.sg/cris/rp/rp00851"
            ],
            "semester": 1,
            "content": {
                "courseAims": "This course aims at developing comprehensive understand ing on thin film deposition principles and techniques. You will gain a fundamental view on the thin film growth process as well as the microstructure that has been developed during the deposition process. The course will help you develop the skills to desi gn thin film systems and select appropriate deposition techniques based upon materials composition, microstructures and properties.",
                "ilo": "By the end of this course, you (as a student)  would be able to:\n1. Explain the molecular behaviours in different vacuum conditions for gas-phase deposition techniques of thin films.\n2. Propose appropriate deposition methods for a targeting thin film structure with desirable properties.\n3. Explain the principles of different film deposition techniques.\n4. Describe the general thin film growth process and evaluate the microstructure evolution during deposition.\n5. Choose the right tools to perform thickness measurement of different thin films and characterize their optical properties.",
                "courseContent": "Vacuum, physical vapor deposition (evaporation and sputtering), chemical vapor deposition, thin film growth and microstructure, epitaxy, liquid phase deposition, characterization methods, thin film properties.",
                "courseReference":"Suggested reading:\n- M. Ohring, The Materials Science of Thin Films, 2nd Edition, 2001, Academic press\n- D. L. Smith, Thin-film deposition, principles and practice, 1995, McGraw-Hill\n - K. Seshan, Handbook of Thin-Film Deposition Processes and Techniques, 2002, William Andrew Publishing\n - K. S. Sree Harsha, Principles of Vapor Deposition of Thin Films, 2006, Elsevier"
            }
        },
        {
            "code": "MS4660",
            "title": "Fundamentals of Intellectual Property in Material Science and Engineering",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4660-fundamentals-of-intellectual-property.pdf?sfvrsn=b5721bd1_16",
            "aus": 3,
            "type": "MPE",
            "instructor": ["MSE(UG) Academic Office/IPOS international"],
            "instructor_link": [],
            "semester": 1,
            "content": {
                "courseAims": "This course provides  you with a working understanding on significant intellectual property (IP) protection regimes in Singapore, covering copyright, patents, registered design, trade marks and trade secrets and the relevant legislation and legal principles.\n\nThe central aim of the course is providing students with the ability to identify, differentiate and apply various aspects of these IP regimes in connection with a business’s intellectual asset outputs.\n\nParticular emphasis will be placed on the legal issues in relation to creation, protection, and exploitation of these intellectual assets. Within this context, the course explores how analysing IP rights protection laws and their considerations can guide a business’s IP strategies, and how a business is able to use such IP considerations to assess the viability of potential courses of action and their plausible business implications.\n\nA note on the legal cases that are highlighted in the study units: these cases are for illustrative purposes in relation to the legal principles discussed; in general students are NOT expected to be able to recall them or use them in presenting arguments for assessment purposes.",
                "ilo": "By the end of this course, student will be able to:\n1) Differentiate the range of IP regimes and their related legislation and regulations.\n2) Describe the qualifying criteria for IP protection/grant of IP rights, and duration of protection under the various IP regimes.\n3) Examine IP assets and determine the most appropriate IP protection regime(s) or strategy for effectiveness.\n4) Evaluate and determine issues relating to ownership and control of IP rights.\n5) Analyse and identify potential infringing behaviour/activities, and possible defences against allegations of infringement.\n6) Recommend appropriate remedies for instances of proven infringement.\n7) Analyse how the protection afforded by each IP protection regime or strategy can steer a business’s IP strategies and objectives.\n8) Assess potential business applications of various IP rights/ assets.\n9) Assess different considerations for the making of IP contracts and transactions.",
                "courseContent": "1. Introduction to IP and Societal Justifications for IP Protection\n2. Understanding the Singapore IP Ecosystem\n3. Copyright Law: Practical Application and Business Considerations\n4. Confidential Information: Practical Application and Business Considerations\n5. Patent Law: Practical Application and Business Considerations\n6. Registered Design Law: Practical Application and Business Considerations\n7. Trade Mark  Law: Practical Application and Business Considerations\n8. Infringement, Defences and Remedies of IP Rights\n9. Commercial Transactions of IP Rights: Licensing and Assignments",
                "courseReference":"Pre readings:\n\n1. IPOS website http://www.ipos.gov.sg\n\n2. Copyright Infopack (IPOS) https://www.ipos.gov.sg/resources/copyright\n\n3. Trade Mark Infopack (IPOS) https://www.ipos.gov.sg/resources/trade-mark\n\n4. Classification of Goods and Services https://www.ipos.gov.sg/resources/trade-mark\n\n· IPA-authored Learner’s Guide containing key content (required)"
            }
        },
        {
            "code": "MS4661",
            "title": "Application of Patents and Designs in Engineering Related Industry",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4661-application-of-patents-designs-in-materials-related-industry.pdf?sfvrsn=783b582f_11",
            "aus": 3,
            "type": "MPE",
            "instructor": ["MSE(UG) Academic Office/IPOS International"],
            "instructor_link": [],
            "semester": 2,
            "content": {
                "courseAims": "This course follows on from the module Fundamentals of IP to provide deeper knowledge and skills relating to some aspects of patent and registered design having substantial relevance in the engineering industry.\n\nThe course provides you with the ability to identify aspects of patent and registered design law, understand how knowledge of patent and registered design law can drive an organization’s IP strategies, and assess potential courses of action concerning patentable inventions and design protection. Particular e mphasis will be placed on the legal issues in relation to creation, protection, and exploitation of these intellectual assets.\n\nA note on the legal cases that are highlighted in the study units: these cases are for illustrative purposes in relation to the legal principles discussed; in general you are NOT expected to be able to recall them or use them in presenting arguments for as sessment purposes.",
                "ilo": "By the end of this course, student will be able to:\n1) Apply the range of the patent and registered design protection regimes and their related legislation and regulations.\n2) Determine the qualifying criteria for protection of patent and design rights, and duration of protection under the respective regimes.\n3) Evaluate patent and registered design protection regime(s) or strategy for IP assets of a business.\n4) Appraise issues relating to ownership and control of patent and registered design rights.\n5) Assess potential infringing behaviour/activities, and possible defences against allegations of infringement.\n6) Appraise appropriate remedies for instances of proven infringement.\n7) Propose how to steer a business’s IP strategies and objectives based on the protection afforded by the patent and registered design protection regime or strategy.\n8) Assess potential business applications of IP rights/assets relating to patent and registered design.\n9) Assess different considerations for the making of IP contracts and transactions focusing on patent and registered design.",
                "courseContent": "1. Development of the Singapore Patent System\n2. Patentability Criteria: Novelty, Inventive Step and Industrial Applicability\n3. Prior  Art and Priority  Claims\n4. Patent  Entitlement  and Inventorship\n5. Assessing Business Strategies: Patenting\n6. Relationship between Patents and Designs: Protection Strategies\n7. Development of the Singapore Designs System\n8. Design Registration Criteria, Ownership, and Rights\n9. Assessing Business Strategies: Registered Designs",
                "courseReference":"· IPA-authored Learner’s Guide containing key content (required)"
            }
        },
        {
            "code": "MS4662",
            "title": "Appreciating IP in Research and Development",
            "coreq": [],
            "prereq": [],
            "link": "https://www.ntu.edu.sg/docs/librariesprovider121/undergraduate/current_students/course_summary/ms4662-appreciating-ip-in-research-and-development.pdf?sfvrsn=8d88ba_16",
            "aus": 3,
            "type": "MPE",
            "instructor": ["MSE(UG) Academic Office/IPOS international"],
            "instructor_link": [],
            "semester": 2,
            "content": {
                "courseAims": "This course provides you with a working understanding on engineering research and development and intellectual property (IP) in related context. It also trains you to apply and use IP knowledge to address real-life IP-related issues in the R&D context.\n\nKey themes that will be covered are assessing IP issues related to R&D, and the implementation and monitoring of suitable approaches to address these IP issues. Expanding on these, the course explores how an understanding of IP rights protection laws and their considerations can guide and support an organisation’s R&D activities and strategies.\n\nParticular emphasis  will be placed on the practical and legal issues in relation to managing the R&D value chain of creation/innovation, identification, ownership, protection, and commercial exploitation of intellectual assets. Case studies related to various branches of engineering including materials science engineering, will be presented and discussed.",
                "ilo": "By the end of this course, student will be able to:\n1) Appraise the objectives and importance of R&D to an organisation.\n2) Identify IP issues in relation to the R&D life cycle and context.\n3) Assess relevant IP management matters in a given R&D context.\n4) Formulate and recommend suitable approaches or relevant IP practices in order to maximize R&D outcomes.\n5) Develop ways to address IP issues arising in R&D life -cycle and R&D management processes.\n6) Explain which stakeholders should be collaborated with in an R&D context.",
                "courseContent": "1. Introduction & Importance of R&D\n2. Objectives of R&D\n3. Assessing IP Issues in Relation to R&D: Types of IP Rights, Knowledge Leakages, Trade Secrets, Collaboration Issues, Methods of Commercialization, Infringement Avoidance\n4. Objectives of approaches to address IP issues\n5. Implementing Courses of Action to address IP issues\n6. Assessing IP Issues in Relation to R&D: Monitoring Implementation\n7. Introduction & Importance of R&D",
                "courseReference":"· IPA-authored Learner’s Guide containing key content (required) \n· Martin A. Bader, Intellectual Property Management in R&D Collaborations, SPRINGER, 2006."
            }
        }
    ],
    "specialisation": [
        {
            "name": "[Select Specialization]",
            "course": []
        },
        {
            "name": "Medical Materials",
            "course": [
                "MS2013",
                "MS4013",
                "MS4610",
                "MS4611",
                "MS4612",
                "MS4613"
            ]
        },
        {
            "name": "Materials & AI",
            "course": [
                "MS1008",
                "MS0003",
                "SC2002",
                "SC3061",
                "SC1007",
                "MS4671"
            ]
        },
        {
            "name": "Industrial Materials Engineering",
            "course": [
                "MS2012",
                "MS3014",
                "MS4603",
                "MS4621",
                "MS4622",
                "MS4630",
                "MS4631",
                "MS4642",
                "MS4663"
            ]
        },
        {
            "name": "Materials and Sustainability",
            "course": [
                "CC0006",
                "MS3011",
                "MS4630",
                "MS4664",
                "MS4665",
                "MS4666",
                "MS4667",
                "EM5101",
                "EM5104",
                "EM5109"
            ]
        },
        {
            "name": "Nanoscience and Nanotechnology",
            "course": [
                "MS3014",
                "MS4014",
                "MS4613",
                "MS4640",
                "MS4650",
                "MS4651"
            ]
        },
        {
            "name": "Innovation and Intelectual Property",
            "course": [
                "MS3015",
                "ML0004",
                "MS4660",
                "MS4661",
                "MS4662",
                "MS4663"
            ]
        }
    ],
    "faculty": [
        {
            "name": "Ali Miserez",
            "email": "ali.miserez@ntu.edu.sg",
            "image": "./images/instructor/Ali Miserez.jpg"
        },
        {
            "name": "Andrew Clive Grimsdale",
            "email": "acgrimsdale@ntu.edu.sg",
            "image": "./images/instructor/Andrew Clive Grimsdale.jpg"
        },
        {
            "name": "Aravind Babu Dasari",
            "email": "aravind@ntu.edu.sg",
            "image": "./images/instructor/Aravind Dasari.jpg"
        },
        {
            "name": "Chen Xiaodong",
            "email": "chenxd@ntu.edu.sg",
            "image": "./images/instructor/Chen Xiaodong.jpg"
        },
        {
            "name": "Chen Zhong",
            "email": "aszchen@ntu.edu.sg",
            "image": "./images/instructor/Chen Zhong.jpg"
        },
        {
            "name": "Cho Nam-Joon",
            "email": "njcho@ntu.edu.sg",
            "image": "./images/instructor/Cho Nam-Joon.jpg"
        },
        {
            "name": "Czarny Bertrand",
            "email": "bczarny@ntu.edu.sg",
            "image": "./images/instructor/Czarny Bertrand.jpg"
        },
        {
            "name": "Dalton Tay Chor Yong",
            "email": "cytay@ntu.edu.sg",
            "image": "./images/instructor/Dalton Tay Chor Yong.jpg"
        },
        {
            "name": "Dalton Tay Chor Yong",
            "email": "cytay@ntu.edu.sg",
            "image": "./images/instructor/Dalton Tay Chor Yong.jpg"
        },
        {
            "name": "Dong Zhili",
            "email": "zldong@ntu.edu.sg",
            "image": "./images/instructor/Dong Zhili.jpg"
        },
        {
            "name": "Fong Wen Mei, Eileen",
            "email": "wmfong@ntu.edu.sg",
            "image": "./images/instructor/Fong Wen Mei, Eileen.jpg"
        },
        {
            "name": "Gan Chee Lip",
            "email": "clgan@ntu.edu.sg",
            "image": "./images/instructor/Prof Gan Chee Lip.jpg"
        },
        {
            "name": "Hng Huey Hoon",
            "email": "ashhhng@ntu.edu.sg",
            "image": "./images/instructor/Hng Huey Hoon.jpg"
        },
        {
            "name": "Hu Xiao",
            "email": "asxhu@ntu.edu.sg",
            "image": "./images/instructor/Hu Xiao.jpg"
        },
        {
            "name": "Huang Yizhong",
            "email": "yzhuang@ntu.edu.sg",
            "image": "./images/instructor/Huang Yizhong.jpg"
        },
        {
            "name": "Jason Xu Zhichuan",
            "email": "xuzc@ntu.edu.sg",
            "image": "./images/instructor/Xu Zhichuan.jpg"
        },
        {
            "name": "Kedar Hippalgaonkar",
            "email": "kedar@ntu.edu.sg",
            "image": "./images/instructor/Kedar Hippalgaonkar.JPG"
        },
        {
            "name": "Lam Yeng Ming",
            "email": "ymlam@ntu.edu.sg",
            "image": "./images/instructor/Lam Yeng Ming.jpg"
        },
        {
            "name": "Lee Pooi See",
            "email": "pslee@ntu.edu.sg",
            "image": "./images/instructor/Lee Pooi See.jpg"
        },
        {
            "name": "Li Shuzhou",
            "email": "lisz@ntu.edu.sg",
            "image": "./images/instructor/Li Shuzhou.jpg"
        },
        {
            "name": "Liu Zheng",
            "email": "z.liu@ntu.edu.sg",
            "image": "./images/instructor/Liu Zheng.jpg"
        },
        {
            "name": "Loo Say Chye Joachim",
            "email": "joachimloo@ntu.edu.sg",
            "image": "./images/instructor/Loo Say Chye Joachim.jpg"
        },
        {
            "name": "Lu Xuehong",
            "email": "asxhlu@ntu.edu.sg",
            "image": "./images/instructor/Lu Xuehong.jpg"
        },
        {
            "name": "Luciana Lisa Lao",
            "email": "lllao@ntu.edu.sg",
            "image": "./images/instructor/Luciana Lisa Lao.jpg"
        },
        {
            "name": "Lydia Helena Wong",
            "email": "lydiawong@ntu.edu.sg",
            "image": "./images/instructor/Lydia Helena Wong.png"
        },
        {
            "name": "Ng Kee Woei",
            "email": "kwng@ntu.edu.sg",
            "image": "./images/instructor/Ng Kee Woei.jpg"
        },
        {
            "name": "Ng Wei Tat, Leonard",
            "email": "leonard.ngwt@ntu.edu.sg",
            "image": "./images/instructor/Ng Wei Tat, Leonard.png"
        },
        {
            "name": "Nripan Mathews",
            "email": "nripan@ntu.edu.sg",
            "image": "./images/instructor/Nripan Mathews.jpg"
        },
        {
            "name": "Oh Joo Tien",
            "email": "asjtoh@ntu.edu.sg",
            "image": "./images/instructor/Oh Joo Tien.jpg"
        },
        {
            "name": "Raju V. Ramanujan",
            "email": "ramanujan@ntu.edu.sg",
            "image": "./images/instructor/Raju V. Ramanujan.jpg"
        },
        {
            "name": "Srinivasan Madhavi",
            "email": "madhavi@ntu.edu.sg",
            "image": "./images/instructor/Madhavi Srinivasan.jpg"
        },
        {
            "name": "Subodh Gautam Mhaisalkar",
            "email": "subodh@ntu.edu.sg",
            "image": "./images/instructor/Subodh Gautam Mhaisalkar.jpg"
        },
        {
            "name": "Tan Kwan Wee",
            "email": "kwtan@ntu.edu.sg",
            "image": "./images/instructor/Tan Kwan Wee.jpg"
        },
        {
            "name": "Tan Lay Poh",
            "email": "lptan@ntu.edu.sg",
            "image": "./images/instructor/Tan Lay Poh.jpg"
        },
        {
            "name": "Terry W.J. Steele",
            "email": "wjsteele@ntu.edu.sg",
            "image": "./images/instructor/Terry W.J. Steele.jpg"
        },
        {
            "name": "Tim White",
            "email": "tjwhite@ntu.edu.sg",
            "image": "./images/instructor/Tim White.jpg"
        },
        {
            "name": "Wu Dongshuang",
            "email": "dongshuang.wu@ntu.edu.sg",
            "image": "./images/instructor/WuDongshuang.jpg"
        },
        {
            "name": "Xiaolei Feng",
            "email": "xiaolei.feng@ntu.edu.sg",
            "image": "./images/instructor/Xiaolei Feng.jpg"
        },
        {
            "name": "Xue Can",
            "email": "cxue@ntu.edu.sg",
            "image": "./images/instructor/Xue Can.jpg"
        },
        {
            "name": "Yan Qingyu",
            "email": "alexyan@ntu.edu.sg",
            "image": "./images/instructor/Alex Yan Qingyu.jpg"
        },
        {
            "name": "Yu Jing",
            "email": "yujing@ntu.edu.sg",
            "image": "./images/instructor/Yu Jing.jpg"
        },
        {
            "name": "Zhao Yang",
            "email": "yzhao@ntu.edu.sg",
            "image": "./images/instructor/Zhao Yang.jpg"
        },
        {
            "name":"Annalisa Bruno",
            "email":"annalisa@ntu.edu.sg",
            "image":"./images/instructor/Annalisa Bruno.png"}
    ]
}